HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/******************  Bit definition for CRM_AHBRST register  ******************/
#define CRM_AHBRST_EMACRST_Pos              (14U)
#define CRM_AHBRST_EMACRST_Msk              (0x1U << CRM_AHBRST_EMACRST_Pos)        /*!< 0x00004000 */
#define CRM_AHBRST_EMACRST                  CRM_AHBRST_EMACRST_Msk                  /*!< Ethernet MAC reset */

/******************  Bit definition for CRM_MISC1 register  *******************/
#define CRM_MISC1_HICKCAL_KEY_Pos           (0U)
#define CRM_MISC1_HICKCAL_KEY_Msk           (0xFFU << CRM_MISC1_HICKCAL_KEY_Pos)    /*!< 0x000000FF */
#define CRM_MISC1_HICKCAL_KEY               CRM_MISC1_HICKCAL_KEY_Msk               /*!< HICK calibration key */
#define CRM_MISC1_USBBUFS_Pos               (24U)
#define CRM_MISC1_USBBUFS_Msk               (0x1U << CRM_MISC1_USBBUFS_Pos)         /*!< 0x01000000 */
#define CRM_MISC1_USBBUFS                   CRM_MISC1_USBBUFS_Msk                   /*!< USB buffer size selection */
#define CRM_MISC1_HICKDIV_Pos               (25U)
#define CRM_MISC1_HICKDIV_Msk               (0x1U << CRM_MISC1_HICKDIV_Pos)         /*!< 0x02000000 */
#define CRM_MISC1_HICKDIV                   CRM_MISC1_HICKDIV_Msk                   /*!< HICK 6 divider selection */

/*!< CLKOUTDIV congiguration */
#define CRM_MISC1_CLKOUTDIV_Pos             (28U)
#define CRM_MISC1_CLKOUTDIV_Msk             (0xFU << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0xF0000000 */
#define CRM_MISC1_CLKOUTDIV                 CRM_MISC1_CLKOUTDIV_Msk                 /*!< CLKOUTDIV[3:0] bits (Clock output division */
#define CRM_MISC1_CLKOUTDIV_0               (0x1U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x10000000 */
#define CRM_MISC1_CLKOUTDIV_1               (0x2U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x20000000 */
#define CRM_MISC1_CLKOUTDIV_2               (0x4U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x40000000 */
#define CRM_MISC1_CLKOUTDIV_3               (0x8U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x80000000 */

#define CRM_MISC1_CLKOUTDIV_DIV1            0x00000000U                             /*!< No clock output */
#define CRM_MISC1_CLKOUTDIV_DIV2            0x80000000U                             /*!< Clock output divided by 2 */
#define CRM_MISC1_CLKOUTDIV_DIV4            0x90000000U                             /*!< Clock output divided by 4 */
#define CRM_MISC1_CLKOUTDIV_DIV8            0xA0000000U                             /*!< Clock output divided by 8 */
#define CRM_MISC1_CLKOUTDIV_DIV16           0xB0000000U                             /*!< Clock output divided by 16 */
#define CRM_MISC1_CLKOUTDIV_DIV64           0xC0000000U                             /*!< Clock output divided by 64 */
#define CRM_MISC1_CLKOUTDIV_DIV128          0xD0000000U                             /*!< Clock output divided by 128 */
#define CRM_MISC1_CLKOUTDIV_DIV256          0xE0000000U                             /*!< Clock output divided by 256 */
#define CRM_MISC1_CLKOUTDIV_DIV512          0xF0000000U                             /*!< Clock output divided by 512 */

/******************  Bit definition for CRM_MISC2 register  *******************/
#define CRM_MISC2_CLK_TO_TMR_Pos            (16U)
#define CRM_MISC2_CLK_TO_TMR_Msk            (0x1U << CRM_MISC2_CLK_TO_TMR_Pos)      /*!< 0x00010000 */
#define CRM_MISC2_CLK_TO_TMR                CRM_MISC2_CLK_TO_TMR_Msk                /*!< CLKOUT internally connected to timer 10 channel 1 */

/******************  Bit definition for CRM_MISC3 register  *******************/
#define CRM_MISC3_AUTO_STEP_EN_Pos          (4U)
#define CRM_MISC3_AUTO_STEP_EN_Msk          (0x3U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000030 */
#define CRM_MISC3_AUTO_STEP_EN              CRM_MISC3_AUTO_STEP_EN_Msk              /*!< AUTO_STEP_EN[1:0] HICK calibration key */
#define CRM_MISC3_AUTO_STEP_EN_0            (0x1U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000010 */
#define CRM_MISC3_AUTO_STEP_EN_1            (0x2U << CRM_MISC3_AUTO_STEP_EN_Pos)    /*!< 0x00000020 */

#define CRM_MISC3_HICK_TO_USB_Pos           (8U)
#define CRM_MISC3_HICK_TO_USB_Msk           (0x1U << CRM_MISC3_HICK_TO_USB_Pos)     /*!< 0x00000100 */
#define CRM_MISC3_HICK_TO_USB               CRM_MISC3_HICK_TO_USB_Msk               /*!< USB 48 MHz clock source select */
#define CRM_MISC3_HICK_TO_SCLK_Pos          (9U)
#define CRM_MISC3_HICK_TO_SCLK_Msk          (0x1U << CRM_MISC3_HICK_TO_SCLK_Pos)    /*!< 0x00000200 */
#define CRM_MISC3_HICK_TO_SCLK              CRM_MISC3_HICK_TO_SCLK_Msk              /*!< HICK as system clock frequency select */

/*!< HEXTDIV congiguration */
#define CRM_MISC3_HEXTDIV_Pos               (12U)
#define CRM_MISC3_HEXTDIV_Msk               (0x3U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00003000 */
#define CRM_MISC3_HEXTDIV                   CRM_MISC3_HEXTDIV_Msk                   /*!< HEXTDIV[1:0] HEXT division */
#define CRM_MISC3_HEXTDIV_0                 (0x1U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00001000 */
#define CRM_MISC3_HEXTDIV_1                 (0x2U << CRM_MISC3_HEXTDIV_Pos)         /*!< 0x00002000 */

#define CRM_MISC3_HEXTDIV_DIV2              0x00000000U                             /*!< HEXT clock is divided by 2 */
#define CRM_MISC3_HEXTDIV_DIV3              0x00001000U                             /*!< HEXT clock is divided by 3 */
#define CRM_MISC3_HEXTDIV_DIV4              0x00002000U                             /*!< HEXT clock is divided by 4 */
#define CRM_MISC3_HEXTDIV_DIV5              0x00003000U                             /*!< HEXT clock is divided by 5 */

#define CRM_MISC3_EMAC_PPS_SEL_Pos          (15U)
#define CRM_MISC3_EMAC_PPS_SEL_Msk          (0x1U << CRM_MISC3_EMAC_PPS_SEL_Pos)    /*!< 0x00008000 */
#define CRM_MISC3_EMAC_PPS_SEL              CRM_MISC3_EMAC_PPS_SEL_Msk              /*!< Ethernet pulse width select */

/******************  Bit definition for CRM_INTMAP register  ******************/
#define CRM_INTMAP_USBINTMAP_Pos            (0U)
#define CRM_INTMAP_USBINTMAP_Msk            (0x1U << CRM_INTMAP_USBINTMAP_Pos)      /*!< 0x00000001 */
#define CRM_INTMAP_USBINTMAP                CRM_INTMAP_USBINTMAP_Msk                /*!< USBFS interrupt remap */

/******************************************************************************/
/*                                                                            */
/*                Flash and User System Data Registers (FLASH)                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_PSR register  ******************/
/*!< Reserved */

/*****************  Bit definition for FLASH_UNLOCK register  *****************/
#define FLASH_UNLOCK_UKVAL_Pos              (0U)
#define FLASH_UNLOCK_UKVAL_Msk              (0xFFFFFFFFU << FLASH_UNLOCK_UKVAL_Pos) /*!< 0xFFFFFFFF */
#define FLASH_UNLOCK_UKVAL                  FLASH_UNLOCK_UKVAL_Msk                  /*!< Unlock key value for flash bank 1 */

