HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define IOMUX_REMAP_SPI3_MUX_Pos            (28U)
#define IOMUX_REMAP_SPI3_MUX_Msk            (0x1U << IOMUX_REMAP_SPI3_MUX_Pos)      /*!< 0x10000000 */
#define IOMUX_REMAP_SPI3_MUX                IOMUX_REMAP_SPI3_MUX_Msk                /*!< SPI3 IO multiplexing */
#define IOMUX_REMAP_TMR2ITR1_MUX_Pos        (29U)
#define IOMUX_REMAP_TMR2ITR1_MUX_Msk        (0x1U << IOMUX_REMAP_TMR2ITR1_MUX_Pos)  /*!< 0x20000000 */
#define IOMUX_REMAP_TMR2ITR1_MUX            IOMUX_REMAP_TMR2ITR1_MUX_Msk            /*!< TMR2 internal trigger 1 multiplexing */
#define IOMUX_REMAP_PTP_PPS_MUX_Pos         (30U)
#define IOMUX_REMAP_PTP_PPS_MUX_Msk         (0x1U << IOMUX_REMAP_PTP_PPS_MUX_Pos)   /*!< 0x40000000 */
#define IOMUX_REMAP_PTP_PPS_MUX             IOMUX_REMAP_PTP_PPS_MUX_Msk             /*!< EMAC PTP PPS IO mutiplexing */

/****************  Bit definition for IOMUX_EXINTC1 register  *****************/
/*!< EXINT0 configuration */
#define IOMUX_EXINTC1_EXINT0_Pos            (0U)
#define IOMUX_EXINTC1_EXINT0_Msk            (0xFU << IOMUX_EXINTC1_EXINT0_Pos)      /*!< 0x0000000F */
#define IOMUX_EXINTC1_EXINT0                IOMUX_EXINTC1_EXINT0_Msk                /*!< EXINT0[3:0] bits (EXINT0 input source configuration) */

#define IOMUX_EXINTC1_EXINT0_GPA            0x00000000U                             /*!< GPIOA pin 0 */
#define IOMUX_EXINTC1_EXINT0_GPB_Pos        (0U)
#define IOMUX_EXINTC1_EXINT0_GPB_Msk        (0x1U << IOMUX_EXINTC1_EXINT0_GPB_Pos)  /*!< 0x00000001 */
#define IOMUX_EXINTC1_EXINT0_GPB            IOMUX_EXINTC1_EXINT0_GPB_Msk            /*!< GPIOB pin 0 */
#define IOMUX_EXINTC1_EXINT0_GPC_Pos        (1U)
#define IOMUX_EXINTC1_EXINT0_GPC_Msk        (0x1U << IOMUX_EXINTC1_EXINT0_GPC_Pos)  /*!< 0x00000002 */
#define IOMUX_EXINTC1_EXINT0_GPC            IOMUX_EXINTC1_EXINT0_GPC_Msk            /*!< GPIOC pin 0 */
#define IOMUX_EXINTC1_EXINT0_GPD_Pos        (0U)
#define IOMUX_EXINTC1_EXINT0_GPD_Msk        (0x3U << IOMUX_EXINTC1_EXINT0_GPD_Pos)  /*!< 0x00000003 */
#define IOMUX_EXINTC1_EXINT0_GPD            IOMUX_EXINTC1_EXINT0_GPD_Msk            /*!< GPIOD pin 0 */
#define IOMUX_EXINTC1_EXINT0_GPE_Pos        (2U)
#define IOMUX_EXINTC1_EXINT0_GPE_Msk        (0x1U << IOMUX_EXINTC1_EXINT0_GPE_Pos)  /*!< 0x00000004 */
#define IOMUX_EXINTC1_EXINT0_GPE            IOMUX_EXINTC1_EXINT0_GPE_Msk            /*!< GPIOE pin 0 */

/*!< EXINT1 configuration */
#define IOMUX_EXINTC1_EXINT1_Pos            (4U)
#define IOMUX_EXINTC1_EXINT1_Msk            (0xFU << IOMUX_EXINTC1_EXINT1_Pos)      /*!< 0x000000F0 */
#define IOMUX_EXINTC1_EXINT1                IOMUX_EXINTC1_EXINT1_Msk                /*!< EXINT1[3:0] bits (EXINT1 input source configuration) */

#define IOMUX_EXINTC1_EXINT1_GPA            0x00000000U                             /*!< GPIOA pin 1 */
#define IOMUX_EXINTC1_EXINT1_GPB_Pos        (4U)
#define IOMUX_EXINTC1_EXINT1_GPB_Msk        (0x1U << IOMUX_EXINTC1_EXINT1_GPB_Pos)  /*!< 0x00000010 */
#define IOMUX_EXINTC1_EXINT1_GPB            IOMUX_EXINTC1_EXINT1_GPB_Msk            /*!< GPIOB pin 1 */
#define IOMUX_EXINTC1_EXINT1_GPC_Pos        (5U)
#define IOMUX_EXINTC1_EXINT1_GPC_Msk        (0x1U << IOMUX_EXINTC1_EXINT1_GPC_Pos)  /*!< 0x00000020 */
#define IOMUX_EXINTC1_EXINT1_GPC            IOMUX_EXINTC1_EXINT1_GPC_Msk            /*!< GPIOC pin 1 */
#define IOMUX_EXINTC1_EXINT1_GPD_Pos        (4U)
#define IOMUX_EXINTC1_EXINT1_GPD_Msk        (0x3U << IOMUX_EXINTC1_EXINT1_GPD_Pos)  /*!< 0x00000030 */
#define IOMUX_EXINTC1_EXINT1_GPD            IOMUX_EXINTC1_EXINT1_GPD_Msk            /*!< GPIOD pin 1 */
#define IOMUX_EXINTC1_EXINT1_GPE_Pos        (6U)
#define IOMUX_EXINTC1_EXINT1_GPE_Msk        (0x1U << IOMUX_EXINTC1_EXINT1_GPE_Pos)  /*!< 0x00000040 */
#define IOMUX_EXINTC1_EXINT1_GPE            IOMUX_EXINTC1_EXINT1_GPE_Msk            /*!< GPIOE pin 1 */

/*!< EXINT2 configuration */
#define IOMUX_EXINTC1_EXINT2_Pos            (8U)
#define IOMUX_EXINTC1_EXINT2_Msk            (0xFU << IOMUX_EXINTC1_EXINT2_Pos)      /*!< 0x00000F00 */
#define IOMUX_EXINTC1_EXINT2                IOMUX_EXINTC1_EXINT2_Msk                /*!< EXINT2[3:0] bits (EXINT2 input source configuration) */

#define IOMUX_EXINTC1_EXINT2_GPA            0x00000000U                             /*!< GPIOA pin 2 */
#define IOMUX_EXINTC1_EXINT2_GPB_Pos        (8U)
#define IOMUX_EXINTC1_EXINT2_GPB_Msk        (0x1U << IOMUX_EXINTC1_EXINT2_GPB_Pos)  /*!< 0x00000100 */
#define IOMUX_EXINTC1_EXINT2_GPB            IOMUX_EXINTC1_EXINT2_GPB_Msk            /*!< GPIOB pin 2 */
#define IOMUX_EXINTC1_EXINT2_GPC_Pos        (9U)
#define IOMUX_EXINTC1_EXINT2_GPC_Msk        (0x1U << IOMUX_EXINTC1_EXINT2_GPC_Pos)  /*!< 0x00000200 */
#define IOMUX_EXINTC1_EXINT2_GPC            IOMUX_EXINTC1_EXINT2_GPC_Msk            /*!< GPIOC pin 2 */
#define IOMUX_EXINTC1_EXINT2_GPD_Pos        (8U)
#define IOMUX_EXINTC1_EXINT2_GPD_Msk        (0x3U << IOMUX_EXINTC1_EXINT2_GPD_Pos)  /*!< 0x00000300 */
#define IOMUX_EXINTC1_EXINT2_GPD            IOMUX_EXINTC1_EXINT2_GPD_Msk            /*!< GPIOD pin 2 */
#define IOMUX_EXINTC1_EXINT2_GPE_Pos        (10U)
#define IOMUX_EXINTC1_EXINT2_GPE_Msk        (0x1U << IOMUX_EXINTC1_EXINT2_GPE_Pos)  /*!< 0x00000400 */
#define IOMUX_EXINTC1_EXINT2_GPE            IOMUX_EXINTC1_EXINT2_GPE_Msk            /*!< GPIOE pin 2 */

/*!< EXINT3 configuration */
#define IOMUX_EXINTC1_EXINT3_Pos            (12U)
#define IOMUX_EXINTC1_EXINT3_Msk            (0xFU << IOMUX_EXINTC1_EXINT3_Pos)      /*!< 0x0000F000 */
#define IOMUX_EXINTC1_EXINT3                IOMUX_EXINTC1_EXINT3_Msk                /*!< EXINT3[3:0] bits (EXINT3 input source configuration) */

#define IOMUX_EXINTC1_EXINT3_GPA            0x00000000U                             /*!< GPIOA pin 3 */
#define IOMUX_EXINTC1_EXINT3_GPB_Pos        (12U)
#define IOMUX_EXINTC1_EXINT3_GPB_Msk        (0x1U << IOMUX_EXINTC1_EXINT3_GPB_Pos)  /*!< 0x00001000 */
#define IOMUX_EXINTC1_EXINT3_GPB            IOMUX_EXINTC1_EXINT3_GPB_Msk            /*!< GPIOB pin 3 */
#define IOMUX_EXINTC1_EXINT3_GPC_Pos        (13U)
#define IOMUX_EXINTC1_EXINT3_GPC_Msk        (0x1U << IOMUX_EXINTC1_EXINT3_GPC_Pos)  /*!< 0x00002000 */
#define IOMUX_EXINTC1_EXINT3_GPC            IOMUX_EXINTC1_EXINT3_GPC_Msk            /*!< GPIOC pin 3 */
#define IOMUX_EXINTC1_EXINT3_GPD_Pos        (12U)
#define IOMUX_EXINTC1_EXINT3_GPD_Msk        (0x3U << IOMUX_EXINTC1_EXINT3_GPD_Pos)  /*!< 0x00003000 */
#define IOMUX_EXINTC1_EXINT3_GPD            IOMUX_EXINTC1_EXINT3_GPD_Msk            /*!< GPIOD pin 3 */
#define IOMUX_EXINTC1_EXINT3_GPE_Pos        (14U)
#define IOMUX_EXINTC1_EXINT3_GPE_Msk        (0x1U << IOMUX_EXINTC1_EXINT3_GPE_Pos)  /*!< 0x00004000 */
#define IOMUX_EXINTC1_EXINT3_GPE            IOMUX_EXINTC1_EXINT3_GPE_Msk            /*!< GPIOE pin 3 */

/****************  Bit definition for IOMUX_EXINTC2 register  *****************/
/*!< EXINT4 configuration */
#define IOMUX_EXINTC2_EXINT4_Pos            (0U)
#define IOMUX_EXINTC2_EXINT4_Msk            (0xFU << IOMUX_EXINTC2_EXINT4_Pos)      /*!< 0x0000000F */
#define IOMUX_EXINTC2_EXINT4                IOMUX_EXINTC2_EXINT4_Msk                /*!< EXINT4[3:0] bits (EXINT4 input source configuration) */

