HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define TMR_STCTRL_ECMBEN_Pos               (14U)
#define TMR_STCTRL_ECMBEN_Msk               (0x1U << TMR_STCTRL_ECMBEN_Pos)         /*!< 0x00004000 */
#define TMR_STCTRL_ECMBEN                   TMR_STCTRL_ECMBEN_Msk                   /*!< External clock mode B enable */
#define TMR_STCTRL_ESP_Pos                  (15U)
#define TMR_STCTRL_ESP_Msk                  (0x1U << TMR_STCTRL_ESP_Pos)            /*!< 0x00008000 */
#define TMR_STCTRL_ESP                      TMR_STCTRL_ESP_Msk                      /*!< External signal polarity */

/*******************  Bit definition for TMR_IDEN register  *******************/
#define TMR_IDEN_OVFIEN_Pos                 (0U)
#define TMR_IDEN_OVFIEN_Msk                 (0x1U << TMR_IDEN_OVFIEN_Pos)           /*!< 0x00000001 */
#define TMR_IDEN_OVFIEN                     TMR_IDEN_OVFIEN_Msk                     /*!< Overflow interrupt enable */
#define TMR_IDEN_C1IEN_Pos                  (1U)
#define TMR_IDEN_C1IEN_Msk                  (0x1U << TMR_IDEN_C1IEN_Pos)            /*!< 0x00000002 */
#define TMR_IDEN_C1IEN                      TMR_IDEN_C1IEN_Msk                      /*!< Channel 1 interrupt enable */
#define TMR_IDEN_C2IEN_Pos                  (2U)
#define TMR_IDEN_C2IEN_Msk                  (0x1U << TMR_IDEN_C2IEN_Pos)            /*!< 0x00000004 */
#define TMR_IDEN_C2IEN                      TMR_IDEN_C2IEN_Msk                      /*!< Channel 2 interrupt enable */
#define TMR_IDEN_C3IEN_Pos                  (3U)
#define TMR_IDEN_C3IEN_Msk                  (0x1U << TMR_IDEN_C3IEN_Pos)            /*!< 0x00000008 */
#define TMR_IDEN_C3IEN                      TMR_IDEN_C3IEN_Msk                      /*!< Channel 3 interrupt enable */
#define TMR_IDEN_C4IEN_Pos                  (4U)
#define TMR_IDEN_C4IEN_Msk                  (0x1U << TMR_IDEN_C4IEN_Pos)            /*!< 0x00000010 */
#define TMR_IDEN_C4IEN                      TMR_IDEN_C4IEN_Msk                      /*!< Channel 4 interrupt enable */
#define TMR_IDEN_HALLIEN_Pos                (5U)
#define TMR_IDEN_HALLIEN_Msk                (0x1U << TMR_IDEN_HALLIEN_Pos)          /*!< 0x00000020 */
#define TMR_IDEN_HALLIEN                    TMR_IDEN_HALLIEN_Msk                    /*!< HALL interrupt enable */
#define TMR_IDEN_TIEN_Pos                   (6U)
#define TMR_IDEN_TIEN_Msk                   (0x1U << TMR_IDEN_TIEN_Pos)             /*!< 0x00000040 */
#define TMR_IDEN_TIEN                       TMR_IDEN_TIEN_Msk                       /*!< Trigger interrupt enable */
#define TMR_IDEN_BRKIE_Pos                  (7U)
#define TMR_IDEN_BRKIE_Msk                  (0x1U << TMR_IDEN_BRKIE_Pos)            /*!< 0x00000080 */
#define TMR_IDEN_BRKIE                      TMR_IDEN_BRKIE_Msk                      /*!< Break interrupt enable */
#define TMR_IDEN_OVFDEN_Pos                 (8U)
#define TMR_IDEN_OVFDEN_Msk                 (0x1U << TMR_IDEN_OVFDEN_Pos)           /*!< 0x00000100 */
#define TMR_IDEN_OVFDEN                     TMR_IDEN_OVFDEN_Msk                     /*!< Overflow event DMA request enable */
#define TMR_IDEN_C1DEN_Pos                  (9U)
#define TMR_IDEN_C1DEN_Msk                  (0x1U << TMR_IDEN_C1DEN_Pos)            /*!< 0x00000200 */
#define TMR_IDEN_C1DEN                      TMR_IDEN_C1DEN_Msk                      /*!< Channel 1 DMA request enable */
#define TMR_IDEN_C2DEN_Pos                  (10U)
#define TMR_IDEN_C2DEN_Msk                  (0x1U << TMR_IDEN_C2DEN_Pos)            /*!< 0x00000400 */
#define TMR_IDEN_C2DEN                      TMR_IDEN_C2DEN_Msk                      /*!< Channel 2 DMA request enable */
#define TMR_IDEN_C3DEN_Pos                  (11U)
#define TMR_IDEN_C3DEN_Msk                  (0x1U << TMR_IDEN_C3DEN_Pos)            /*!< 0x00000800 */
#define TMR_IDEN_C3DEN                      TMR_IDEN_C3DEN_Msk                      /*!< Channel 3 DMA request enable */
#define TMR_IDEN_C4DEN_Pos                  (12U)
#define TMR_IDEN_C4DEN_Msk                  (0x1U << TMR_IDEN_C4DEN_Pos)            /*!< 0x00001000 */
#define TMR_IDEN_C4DEN                      TMR_IDEN_C4DEN_Msk                      /*!< Channel 4 DMA request enable */
#define TMR_IDEN_HALLDE_Pos                 (13U)
#define TMR_IDEN_HALLDE_Msk                 (0x1U << TMR_IDEN_HALLDE_Pos)           /*!< 0x00002000 */
#define TMR_IDEN_HALLDE                     TMR_IDEN_HALLDE_Msk                     /*!< HALL DMA request enable */
#define TMR_IDEN_TDEN_Pos                   (14U)
#define TMR_IDEN_TDEN_Msk                   (0x1U << TMR_IDEN_TDEN_Pos)             /*!< 0x00004000 */
#define TMR_IDEN_TDEN                       TMR_IDEN_TDEN_Msk                       /*!< Trigger DMA request enable */

/*******************  Bit definition for TMR_ISTS register  *******************/
#define TMR_ISTS_OVFIF_Pos                  (0U)
#define TMR_ISTS_OVFIF_Msk                  (0x1U << TMR_ISTS_OVFIF_Pos)            /*!< 0x00000001 */
#define TMR_ISTS_OVFIF                      TMR_ISTS_OVFIF_Msk                      /*!< Overflow interrupt flag */
#define TMR_ISTS_C1IF_Pos                   (1U)
#define TMR_ISTS_C1IF_Msk                   (0x1U << TMR_ISTS_C1IF_Pos)             /*!< 0x00000002 */
#define TMR_ISTS_C1IF                       TMR_ISTS_C1IF_Msk                       /*!< Channel 1 interrupt flag */
#define TMR_ISTS_C2IF_Pos                   (2U)
#define TMR_ISTS_C2IF_Msk                   (0x1U << TMR_ISTS_C2IF_Pos)             /*!< 0x00000004 */
#define TMR_ISTS_C2IF                       TMR_ISTS_C2IF_Msk                       /*!< Channel 2 interrupt flag */
#define TMR_ISTS_C3IF_Pos                   (3U)
#define TMR_ISTS_C3IF_Msk                   (0x1U << TMR_ISTS_C3IF_Pos)             /*!< 0x00000008 */
#define TMR_ISTS_C3IF                       TMR_ISTS_C3IF_Msk                       /*!< Channel 3 interrupt flag */
#define TMR_ISTS_C4IF_Pos                   (4U)
#define TMR_ISTS_C4IF_Msk                   (0x1U << TMR_ISTS_C4IF_Pos)             /*!< 0x00000010 */
#define TMR_ISTS_C4IF                       TMR_ISTS_C4IF_Msk                       /*!< Channel 4 interrupt flag */
#define TMR_ISTS_HALLIF_Pos                 (5U)
#define TMR_ISTS_HALLIF_Msk                 (0x1U << TMR_ISTS_HALLIF_Pos)           /*!< 0x00000020 */
#define TMR_ISTS_HALLIF                     TMR_ISTS_HALLIF_Msk                     /*!< HALL interrupt flag */
#define TMR_ISTS_TRGIF_Pos                  (6U)
#define TMR_ISTS_TRGIF_Msk                  (0x1U << TMR_ISTS_TRGIF_Pos)            /*!< 0x00000040 */
#define TMR_ISTS_TRGIF                      TMR_ISTS_TRGIF_Msk                      /*!< Trigger interrupt flag */
#define TMR_ISTS_BRKIF_Pos                  (7U)
#define TMR_ISTS_BRKIF_Msk                  (0x1U << TMR_ISTS_BRKIF_Pos)            /*!< 0x00000080 */
#define TMR_ISTS_BRKIF                      TMR_ISTS_BRKIF_Msk                      /*!< Break interrupt flag */
#define TMR_ISTS_C1RF_Pos                   (9U)
#define TMR_ISTS_C1RF_Msk                   (0x1U << TMR_ISTS_C1RF_Pos)             /*!< 0x00000200 */
#define TMR_ISTS_C1RF                       TMR_ISTS_C1RF_Msk                       /*!< Channel 1 recapture flag */
#define TMR_ISTS_C2RF_Pos                   (10U)
#define TMR_ISTS_C2RF_Msk                   (0x1U << TMR_ISTS_C2RF_Pos)             /*!< 0x00000400 */
#define TMR_ISTS_C2RF                       TMR_ISTS_C2RF_Msk                       /*!< Channel 2 recapture flag */
#define TMR_ISTS_C3RF_Pos                   (11U)
#define TMR_ISTS_C3RF_Msk                   (0x1U << TMR_ISTS_C3RF_Pos)             /*!< 0x00000800 */
#define TMR_ISTS_C3RF                       TMR_ISTS_C3RF_Msk                       /*!< Channel 3 recapture flag */
#define TMR_ISTS_C4RF_Pos                   (12U)
#define TMR_ISTS_C4RF_Msk                   (0x1U << TMR_ISTS_C4RF_Pos)             /*!< 0x00001000 */
#define TMR_ISTS_C4RF                       TMR_ISTS_C4RF_Msk                       /*!< Channel 4 recapture flag */

