HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/* Legacy defines */
#define WWDT_CFG_DIV0                       WWDT_CFG_DIV_0
#define WWDT_CFG_DIV1                       WWDT_CFG_DIV_1

#define WWDT_CFG_RLDIEN_Pos                 (9U)
#define WWDT_CFG_RLDIEN_Msk                 (0x1U << WWDT_CFG_RLDIEN_Pos)           /*!< 0x00000200 */
#define WWDT_CFG_RLDIEN                     WWDT_CFG_RLDIEN_Msk                     /*!< Reload counter interrupt */

/*******************  Bit definition for WWDT_STS register  *******************/
#define WWDT_STS_RLDF_Pos                   (0U)
#define WWDT_STS_RLDF_Msk                   (0x1U << WWDT_STS_RLDF_Pos)             /*!< 0x00000001 */
#define WWDT_STS_RLDF                       WWDT_STS_RLDF_Msk                       /*!< Reload counter interrupt flag */

/******************************************************************************/
/*                                                                            */
/*                            Watchdog timer (WDT)                            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WDT_CMD register  ********************/
#define WDT_CMD_CMD_Pos                     (0U)
#define WDT_CMD_CMD_Msk                     (0xFFFFU << WDT_CMD_CMD_Pos)            /*!< 0x0000FFFF */
#define WDT_CMD_CMD                         WDT_CMD_CMD_Msk                         /*!< Command register */

/*******************  Bit definition for WDT_DIV register  ********************/
#define WDT_DIV_DIV_Pos                     (0U)
#define WDT_DIV_DIV_Msk                     (0x7U << WDT_DIV_DIV_Pos)               /*!< 0x00000007 */
#define WDT_DIV_DIV                         WDT_DIV_DIV_Msk                         /*!< DIV[2:0] (Clock division value) */
#define WDT_DIV_DIV_0                       (0x1U << WDT_DIV_DIV_Pos)               /*!< 0x00000001 */
#define WDT_DIV_DIV_1                       (0x2U << WDT_DIV_DIV_Pos)               /*!< 0x00000002 */
#define WDT_DIV_DIV_2                       (0x4U << WDT_DIV_DIV_Pos)               /*!< 0x00000004 */

/*******************  Bit definition for WDT_RLD register  ********************/
#define WDT_RLD_RLD_Pos                     (0U)
#define WDT_RLD_RLD_Msk                     (0xFFFU << WDT_RLD_RLD_Pos)             /*!< 0x00000FFF */
#define WDT_RLD_RLD                         WDT_RLD_RLD_Msk                         /*!< Reload value */

/*******************  Bit definition for WDT_STS register  ********************/
#define WDT_STS_DIVF_Pos                    (0U)
#define WDT_STS_DIVF_Msk                    (0x1U << WDT_STS_DIVF_Pos)              /*!< 0x00000001 */
#define WDT_STS_DIVF                        WDT_STS_DIVF_Msk                        /*!< Division value update complete flag */
#define WDT_STS_RLDF_Pos                    (1U)
#define WDT_STS_RLDF_Msk                    (0x1U << WDT_STS_RLDF_Pos)              /*!< 0x00000002 */
#define WDT_STS_RLDF                        WDT_STS_RLDF_Msk                        /*!< Reload value update complete flag */

/******************************************************************************/
/*                                                                            */
/*                           Real-time clock (RTC)                            */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for RTC_CTRLH register  *******************/
#define RTC_CTRLH_TSIEN_Pos                 (0U)
#define RTC_CTRLH_TSIEN_Msk                 (0x1U << RTC_CTRLH_TSIEN_Pos)           /*!< 0x00000001 */
#define RTC_CTRLH_TSIEN                     RTC_CTRLH_TSIEN_Msk                     /*!< Time second interrupt enable */
#define RTC_CTRLH_TAIEN_Pos                 (1U)
#define RTC_CTRLH_TAIEN_Msk                 (0x1U << RTC_CTRLH_TAIEN_Pos)           /*!< 0x00000002 */
#define RTC_CTRLH_TAIEN                     RTC_CTRLH_TAIEN_Msk                     /*!< Time alarm interrupt enable */
#define RTC_CTRLH_OVFIEN_Pos                (2U)
#define RTC_CTRLH_OVFIEN_Msk                (0x1U << RTC_CTRLH_OVFIEN_Pos)          /*!< 0x00000004 */
#define RTC_CTRLH_OVFIEN                    RTC_CTRLH_OVFIEN_Msk                    /*!< Overflow interrupt enable */

/******************  Bit definition for RTC_CTRLL register  *******************/
#define RTC_CTRLL_TSF_Pos                   (0U)
#define RTC_CTRLL_TSF_Msk                   (0x1U << RTC_CTRLL_TSF_Pos)             /*!< 0x00000001 */
#define RTC_CTRLL_TSF                       RTC_CTRLL_TSF_Msk                       /*!< Time second flag */
#define RTC_CTRLL_TAF_Pos                   (1U)
#define RTC_CTRLL_TAF_Msk                   (0x1U << RTC_CTRLL_TAF_Pos)             /*!< 0x00000002 */
#define RTC_CTRLL_TAF                       RTC_CTRLL_TAF_Msk                       /*!< Time alarm flag */
#define RTC_CTRLL_OVFF_Pos                  (2U)
#define RTC_CTRLL_OVFF_Msk                  (0x1U << RTC_CTRLL_OVFF_Pos)            /*!< 0x00000004 */
#define RTC_CTRLL_OVFF                      RTC_CTRLL_OVFF_Msk                      /*!< Overflow flag */
#define RTC_CTRLL_UPDF_Pos                  (3U)
#define RTC_CTRLL_UPDF_Msk                  (0x1U << RTC_CTRLL_UPDF_Pos)            /*!< 0x00000008 */
#define RTC_CTRLL_UPDF                      RTC_CTRLL_UPDF_Msk                      /*!< RTC update finish flag */
#define RTC_CTRLL_CFGEN_Pos                 (4U)
#define RTC_CTRLL_CFGEN_Msk                 (0x1U << RTC_CTRLL_CFGEN_Pos)           /*!< 0x00000010 */
#define RTC_CTRLL_CFGEN                     RTC_CTRLL_CFGEN_Msk                     /*!< RTC configuration enable */
#define RTC_CTRLL_CFGF_Pos                  (5U)
#define RTC_CTRLL_CFGF_Msk                  (0x1U << RTC_CTRLL_CFGF_Pos)            /*!< 0x00000020 */
#define RTC_CTRLL_CFGF                      RTC_CTRLL_CFGF_Msk                      /*!< RTC configuration finish */

/*******************  Bit definition for RTC_DIVH register  *******************/
#define RTC_DIVH_DIV_Pos                    (0U)
#define RTC_DIVH_DIV_Msk                    (0xFU << RTC_DIVH_DIV_Pos)              /*!< 0x0000000F */
#define RTC_DIVH_DIV                        RTC_DIVH_DIV_Msk                        /*!< RTC divider high */

