HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/*******************  Bit definition for BPR_CTRL register  *******************/
#define BPR_CTRL_TPEN_Pos                   (0U)
#define BPR_CTRL_TPEN_Msk                   (0x1U << BPR_CTRL_TPEN_Pos)             /*!< 0x00000001 */
#define BPR_CTRL_TPEN                       BPR_CTRL_TPEN_Msk                       /*!< TAMPER pin enable */
#define BPR_CTRL_TPP_Pos                    (1U)
#define BPR_CTRL_TPP_Msk                    (0x1U << BPR_CTRL_TPP_Pos)              /*!< 0x00000002 */
#define BPR_CTRL_TPP                        BPR_CTRL_TPP_Msk                        /*!< TAMPER pin polarity */

/*****************  Bit definition for BPR_CTRLSTS register  ******************/
#define BPR_CTRLSTS_TPEFCLR_Pos             (0U)
#define BPR_CTRLSTS_TPEFCLR_Msk             (0x1U << BPR_CTRLSTS_TPEFCLR_Pos)       /*!< 0x00000001 */
#define BPR_CTRLSTS_TPEFCLR                 BPR_CTRLSTS_TPEFCLR_Msk                 /*!< TAMPER event flag clear */
#define BPR_CTRLSTS_TPIFCLR_Pos             (1U)
#define BPR_CTRLSTS_TPIFCLR_Msk             (0x1U << BPR_CTRLSTS_TPIFCLR_Pos)       /*!< 0x00000002 */
#define BPR_CTRLSTS_TPIFCLR                 BPR_CTRLSTS_TPIFCLR_Msk                 /*!< TAMPER interrupt flag clear */
#define BPR_CTRLSTS_TPIEN_Pos               (2U)
#define BPR_CTRLSTS_TPIEN_Msk               (0x1U << BPR_CTRLSTS_TPIEN_Pos)         /*!< 0x00000004 */
#define BPR_CTRLSTS_TPIEN                   BPR_CTRLSTS_TPIEN_Msk                   /*!< TAMPER pin interrupt enable */
#define BPR_CTRLSTS_TPEF_Pos                (8U)
#define BPR_CTRLSTS_TPEF_Msk                (0x1U << BPR_CTRLSTS_TPEF_Pos)          /*!< 0x00000100 */
#define BPR_CTRLSTS_TPEF                    BPR_CTRLSTS_TPEF_Msk                    /*!< TAMPER event flag */
#define BPR_CTRLSTS_TPIF_Pos                (9U)
#define BPR_CTRLSTS_TPIF_Msk                (0x1U << BPR_CTRLSTS_TPIF_Pos)          /*!< 0x00000200 */
#define BPR_CTRLSTS_TPIF                    BPR_CTRLSTS_TPIF_Msk                    /*!< TAMPER interrupt flag */

/******************************************************************************/
/*                                                                            */
/*                     Analog-to-digital converter (ADC)                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for ADC_STS register  ********************/
#define ADC_STS_VMOR_Pos                    (0U)
#define ADC_STS_VMOR_Msk                    (0x1U << ADC_STS_VMOR_Pos)              /*!< 0x00000001 */
#define ADC_STS_VMOR                        ADC_STS_VMOR_Msk                        /*!< Voltage monitoring out of range flag */
#define ADC_STS_CCC_Pos                     (1U)
#define ADC_STS_CCC_Msk                     (0x1U << ADC_STS_CCC_Pos)               /*!< 0x00000002 */
#define ADC_STS_CCC                         ADC_STS_CCC_Msk                         /*!< End of conversion flag */
#define ADC_STS_PCCC_Pos                    (2U)
#define ADC_STS_PCCC_Msk                    (0x1U << ADC_STS_PCCC_Pos)              /*!< 0x00000004 */
#define ADC_STS_PCCC                        ADC_STS_PCCC_Msk                        /*!< Preempted channel end of conversion flag */
#define ADC_STS_PCCS_Pos                    (3U)
#define ADC_STS_PCCS_Msk                    (0x1U << ADC_STS_PCCS_Pos)              /*!< 0x00000008 */
#define ADC_STS_PCCS                        ADC_STS_PCCS_Msk                        /*!< Preempted channel conversion start flag */
#define ADC_STS_OCCS_Pos                    (4U)
#define ADC_STS_OCCS_Msk                    (0x1U << ADC_STS_OCCS_Pos)              /*!< 0x00000010 */
#define ADC_STS_OCCS                        ADC_STS_OCCS_Msk                        /*!< Ordinary channel conversion start flag */

/* Legacy defines */
#define ADC_STS_CCE                         (ADC_STS_CCC)
#define ADC_STS_PCCE                        (ADC_STS_PCCC)

/******************  Bit definition for ADC_CTRL1 register  *******************/
#define ADC_CTRL1_VMCSEL_Pos                (0U)
#define ADC_CTRL1_VMCSEL_Msk                (0x1FU << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x0000001F */
#define ADC_CTRL1_VMCSEL                    ADC_CTRL1_VMCSEL_Msk                    /*!< VMCSEL[4:0] bits (Voltage monitoring channel select) */
#define ADC_CTRL1_VMCSEL_0                  (0x01U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000001 */
#define ADC_CTRL1_VMCSEL_1                  (0x02U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000002 */
#define ADC_CTRL1_VMCSEL_2                  (0x04U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000004 */
#define ADC_CTRL1_VMCSEL_3                  (0x08U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000008 */
#define ADC_CTRL1_VMCSEL_4                  (0x10U << ADC_CTRL1_VMCSEL_Pos)         /*!< 0x00000010 */

#define ADC_CTRL1_CCCIEN_Pos                (5U)
#define ADC_CTRL1_CCCIEN_Msk                (0x1U << ADC_CTRL1_CCCIEN_Pos)          /*!< 0x00000020 */
#define ADC_CTRL1_CCCIEN                    ADC_CTRL1_CCCIEN_Msk                    /*!< Channel conversion end interrupt enable */
#define ADC_CTRL1_VMORIEN_Pos               (6U)
#define ADC_CTRL1_VMORIEN_Msk               (0x1U << ADC_CTRL1_VMORIEN_Pos)         /*!< 0x00000040 */
#define ADC_CTRL1_VMORIEN                   ADC_CTRL1_VMORIEN_Msk                   /*!< Voltage monitoring out of range interrupt enable */
#define ADC_CTRL1_PCCCIEN_Pos               (7U)
#define ADC_CTRL1_PCCCIEN_Msk               (0x1U << ADC_CTRL1_PCCCIEN_Pos)         /*!< 0x00000080 */
#define ADC_CTRL1_PCCCIEN                   ADC_CTRL1_PCCCIEN_Msk                   /*!< Conversion end interrupt enable on Preempted channels */
#define ADC_CTRL1_SQEN_Pos                  (8U)
#define ADC_CTRL1_SQEN_Msk                  (0x1U << ADC_CTRL1_SQEN_Pos)            /*!< 0x00000100 */
#define ADC_CTRL1_SQEN                      ADC_CTRL1_SQEN_Msk                      /*!< Sequence mode enable */
#define ADC_CTRL1_VMSGEN_Pos                (9U)
#define ADC_CTRL1_VMSGEN_Msk                (0x1U << ADC_CTRL1_VMSGEN_Pos)          /*!< 0x00000200 */
#define ADC_CTRL1_VMSGEN                    ADC_CTRL1_VMSGEN_Msk                    /*!< Voltage monitoring enable on a single channel */
#define ADC_CTRL1_PCAUTOEN_Pos              (10U)
#define ADC_CTRL1_PCAUTOEN_Msk              (0x1U << ADC_CTRL1_PCAUTOEN_Pos)        /*!< 0x00000400 */
#define ADC_CTRL1_PCAUTOEN                  ADC_CTRL1_PCAUTOEN_Msk                  /*!< Preempted group automatic conversion enable after ordinary group */
#define ADC_CTRL1_OCPEN_Pos                 (11U)
#define ADC_CTRL1_OCPEN_Msk                 (0x1U << ADC_CTRL1_OCPEN_Pos)           /*!< 0x00000800 */
#define ADC_CTRL1_OCPEN                     ADC_CTRL1_OCPEN_Msk                     /*!< Partitioned mode enable on ordinary channels */
#define ADC_CTRL1_PCPEN_Pos                 (12U)
#define ADC_CTRL1_PCPEN_Msk                 (0x1U << ADC_CTRL1_PCPEN_Pos)           /*!< 0x00001000 */
#define ADC_CTRL1_PCPEN                     ADC_CTRL1_PCPEN_Msk                     /*!< Partitioned mode enable on preempted channels */

