HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/******************  Bit definition for ADC_PCDTO1 register  ******************/
#define ADC_PCDTO1_PCDTO1_Pos               (0U)
#define ADC_PCDTO1_PCDTO1_Msk               (0xFFFU << ADC_PCDTO1_PCDTO1_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO1_PCDTO1                   ADC_PCDTO1_PCDTO1_Msk                   /*!< Data offset for Preempted channel 1 */

/******************  Bit definition for ADC_PCDTO2 register  ******************/
#define ADC_PCDTO2_PCDTO2_Pos               (0U)
#define ADC_PCDTO2_PCDTO2_Msk               (0xFFFU << ADC_PCDTO2_PCDTO2_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO2_PCDTO2                   ADC_PCDTO2_PCDTO2_Msk                   /*!< Data offset for Preempted channel 2 */

/******************  Bit definition for ADC_PCDTO3 register  ******************/
#define ADC_PCDTO3_PCDTO3_Pos               (0U)
#define ADC_PCDTO3_PCDTO3_Msk               (0xFFFU << ADC_PCDTO3_PCDTO3_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO3_PCDTO3                   ADC_PCDTO3_PCDTO3_Msk                   /*!< Data offset for Preempted channel 3 */

/******************  Bit definition for ADC_PCDTO4 register  ******************/
#define ADC_PCDTO4_PCDTO4_Pos               (0U)
#define ADC_PCDTO4_PCDTO4_Msk               (0xFFFU << ADC_PCDTO4_PCDTO4_Pos)       /*!< 0x00000FFF */
#define ADC_PCDTO4_PCDTO4                   ADC_PCDTO4_PCDTO4_Msk                   /*!< Data offset for Preempted channel 4 */

/*******************  Bit definition for ADC_VMHB register  ********************/
#define ADC_VMHB_VMHB_Pos                   (0U)
#define ADC_VMHB_VMHB_Msk                   (0xFFFU << ADC_VMHB_VMHB_Pos)           /*!< 0x00000FFF */
#define ADC_VMHB_VMHB                       ADC_VMHB_VMHB_Msk                       /*!< Voltage monitoring high boundary */

/*******************  Bit definition for ADC_VMLB register  ********************/
#define ADC_VMLB_VMLB_Pos                   (0U)
#define ADC_VMLB_VMLB_Msk                   (0xFFFU << ADC_VMLB_VMLB_Pos)           /*!< 0x00000FFF */
#define ADC_VMLB_VMLB                       ADC_VMLB_VMLB_Msk                       /*!< Voltage monitoring low boundary */

/*******************  Bit definition for ADC_OSQ1 register  *******************/
#define ADC_OSQ1_OSN13_Pos                  (0U)
#define ADC_OSQ1_OSN13_Msk                  (0x1FU << ADC_OSQ1_OSN13_Pos)           /*!< 0x0000001F */
#define ADC_OSQ1_OSN13                      ADC_OSQ1_OSN13_Msk                      /*!< OSN13[4:0] bits (Number of 13th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN13_0                    (0x01U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000001 */
#define ADC_OSQ1_OSN13_1                    (0x02U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000002 */
#define ADC_OSQ1_OSN13_2                    (0x04U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000004 */
#define ADC_OSQ1_OSN13_3                    (0x08U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000008 */
#define ADC_OSQ1_OSN13_4                    (0x10U << ADC_OSQ1_OSN13_Pos)           /*!< 0x00000010 */

#define ADC_OSQ1_OSN14_Pos                  (5U)
#define ADC_OSQ1_OSN14_Msk                  (0x1FU << ADC_OSQ1_OSN14_Pos)           /*!< 0x000003E0 */
#define ADC_OSQ1_OSN14                      ADC_OSQ1_OSN14_Msk                      /*!< OSN14[4:0] bits (Number of 14th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN14_0                    (0x01U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000020 */
#define ADC_OSQ1_OSN14_1                    (0x02U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000040 */
#define ADC_OSQ1_OSN14_2                    (0x04U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000080 */
#define ADC_OSQ1_OSN14_3                    (0x08U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000100 */
#define ADC_OSQ1_OSN14_4                    (0x10U << ADC_OSQ1_OSN14_Pos)           /*!< 0x00000200 */

#define ADC_OSQ1_OSN15_Pos                  (10U)
#define ADC_OSQ1_OSN15_Msk                  (0x1FU << ADC_OSQ1_OSN15_Pos)           /*!< 0x00007C00 */
#define ADC_OSQ1_OSN15                      ADC_OSQ1_OSN15_Msk                      /*!< OSN15[4:0] bits (Number of 15th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN15_0                    (0x01U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00000400 */
#define ADC_OSQ1_OSN15_1                    (0x02U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00000800 */
#define ADC_OSQ1_OSN15_2                    (0x04U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00001000 */
#define ADC_OSQ1_OSN15_3                    (0x08U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00002000 */
#define ADC_OSQ1_OSN15_4                    (0x10U << ADC_OSQ1_OSN15_Pos)           /*!< 0x00004000 */

#define ADC_OSQ1_OSN16_Pos                  (15U)
#define ADC_OSQ1_OSN16_Msk                  (0x1FU << ADC_OSQ1_OSN16_Pos)           /*!< 0x000F8000 */
#define ADC_OSQ1_OSN16                      ADC_OSQ1_OSN16_Msk                      /*!< OSN16[4:0] bits (Number of 16th conversion in ordinary sequence) */
#define ADC_OSQ1_OSN16_0                    (0x01U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00008000 */
#define ADC_OSQ1_OSN16_1                    (0x02U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00010000 */
#define ADC_OSQ1_OSN16_2                    (0x04U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00020000 */
#define ADC_OSQ1_OSN16_3                    (0x08U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00040000 */
#define ADC_OSQ1_OSN16_4                    (0x10U << ADC_OSQ1_OSN16_Pos)           /*!< 0x00080000 */

#define ADC_OSQ1_OCLEN_Pos                  (20U)
#define ADC_OSQ1_OCLEN_Msk                  (0xFU << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00F00000 */
#define ADC_OSQ1_OCLEN                      ADC_OSQ1_OCLEN_Msk                      /*!< OCLEN[3:0] bits (Ordinary conversion sequence length) */
#define ADC_OSQ1_OCLEN_0                    (0x1U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00100000 */
#define ADC_OSQ1_OCLEN_1                    (0x2U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00200000 */
#define ADC_OSQ1_OCLEN_2                    (0x4U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00400000 */
#define ADC_OSQ1_OCLEN_3                    (0x8U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00800000 */

/*******************  Bit definition for ADC_OSQ2 register  *******************/
#define ADC_OSQ2_OSN7_Pos                   (0U)
#define ADC_OSQ2_OSN7_Msk                   (0x1FU << ADC_OSQ2_OSN7_Pos)            /*!< 0x0000001F */
#define ADC_OSQ2_OSN7                       ADC_OSQ2_OSN7_Msk                       /*!< OSN7[4:0] bits (Number of 7th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN7_0                     (0x01U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000001 */
#define ADC_OSQ2_OSN7_1                     (0x02U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000002 */
#define ADC_OSQ2_OSN7_2                     (0x04U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000004 */
#define ADC_OSQ2_OSN7_3                     (0x08U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000008 */
#define ADC_OSQ2_OSN7_4                     (0x10U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000010 */

