HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define ADC_OSQ3_OSN5_Pos                   (20U)
#define ADC_OSQ3_OSN5_Msk                   (0x1FU << ADC_OSQ3_OSN5_Pos)            /*!< 0x01F00000 */
#define ADC_OSQ3_OSN5                       ADC_OSQ3_OSN5_Msk                       /*!< OSN5[4:0] bits (Number of 5th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN5_0                     (0x01U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00100000 */
#define ADC_OSQ3_OSN5_1                     (0x02U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00200000 */
#define ADC_OSQ3_OSN5_2                     (0x04U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00400000 */
#define ADC_OSQ3_OSN5_3                     (0x08U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00800000 */
#define ADC_OSQ3_OSN5_4                     (0x10U << ADC_OSQ3_OSN5_Pos)            /*!< 0x01000000 */

#define ADC_OSQ3_OSN6_Pos                   (25U)
#define ADC_OSQ3_OSN6_Msk                   (0x1FU << ADC_OSQ3_OSN6_Pos)            /*!< 0x3E000000 */
#define ADC_OSQ3_OSN6                       ADC_OSQ3_OSN6_Msk                       /*!< OSN6[4:0] bits (Number of 6th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN6_0                     (0x01U << ADC_OSQ3_OSN6_Pos)            /*!< 0x02000000 */
#define ADC_OSQ3_OSN6_1                     (0x02U << ADC_OSQ3_OSN6_Pos)            /*!< 0x04000000 */
#define ADC_OSQ3_OSN6_2                     (0x04U << ADC_OSQ3_OSN6_Pos)            /*!< 0x08000000 */
#define ADC_OSQ3_OSN6_3                     (0x08U << ADC_OSQ3_OSN6_Pos)            /*!< 0x10000000 */
#define ADC_OSQ3_OSN6_4                     (0x10U << ADC_OSQ3_OSN6_Pos)            /*!< 0x20000000 */

/*******************  Bit definition for ADC_PSQ register  ********************/
#define ADC_PSQ_PSN1_Pos                    (0U)
#define ADC_PSQ_PSN1_Msk                    (0x1FU << ADC_PSQ_PSN1_Pos)             /*!< 0x0000001F */
#define ADC_PSQ_PSN1                        ADC_PSQ_PSN1_Msk                        /*!< PSN1[4:0] bits (Number of 1st conversion in preempted sequence) */
#define ADC_PSQ_PSN1_0                      (0x01U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000001 */
#define ADC_PSQ_PSN1_1                      (0x02U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000002 */
#define ADC_PSQ_PSN1_2                      (0x04U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000004 */
#define ADC_PSQ_PSN1_3                      (0x08U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000008 */
#define ADC_PSQ_PSN1_4                      (0x10U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000010 */

#define ADC_PSQ_PSN2_Pos                    (5U)
#define ADC_PSQ_PSN2_Msk                    (0x1FU << ADC_PSQ_PSN2_Pos)             /*!< 0x000003E0 */
#define ADC_PSQ_PSN2                        ADC_PSQ_PSN2_Msk                        /*!< PSN2[4:0] bits (Number of 2nd conversion in preempted sequence) */
#define ADC_PSQ_PSN2_0                      (0x01U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000020 */
#define ADC_PSQ_PSN2_1                      (0x02U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000040 */
#define ADC_PSQ_PSN2_2                      (0x04U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000080 */
#define ADC_PSQ_PSN2_3                      (0x08U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000100 */
#define ADC_PSQ_PSN2_4                      (0x10U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000200 */

#define ADC_PSQ_PSN3_Pos                    (10U)
#define ADC_PSQ_PSN3_Msk                    (0x1FU << ADC_PSQ_PSN3_Pos)             /*!< 0x00007C00 */
#define ADC_PSQ_PSN3                        ADC_PSQ_PSN3_Msk                        /*!< PSN3[4:0] bits (Number of 3rd conversion in preempted sequence) */
#define ADC_PSQ_PSN3_0                      (0x01U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000400 */
#define ADC_PSQ_PSN3_1                      (0x02U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000800 */
#define ADC_PSQ_PSN3_2                      (0x04U << ADC_PSQ_PSN3_Pos)             /*!< 0x00001000 */
#define ADC_PSQ_PSN3_3                      (0x08U << ADC_PSQ_PSN3_Pos)             /*!< 0x00002000 */
#define ADC_PSQ_PSN3_4                      (0x10U << ADC_PSQ_PSN3_Pos)             /*!< 0x00004000 */

#define ADC_PSQ_PSN4_Pos                    (15U)
#define ADC_PSQ_PSN4_Msk                    (0x1FU << ADC_PSQ_PSN4_Pos)             /*!< 0x000F8000 */
#define ADC_PSQ_PSN4                        ADC_PSQ_PSN4_Msk                        /*!< PSN4[4:0] bits (Number of 4th conversion in preempted sequence) */
#define ADC_PSQ_PSN4_0                      (0x01U << ADC_PSQ_PSN4_Pos)             /*!< 0x00008000 */
#define ADC_PSQ_PSN4_1                      (0x02U << ADC_PSQ_PSN4_Pos)             /*!< 0x00010000 */
#define ADC_PSQ_PSN4_2                      (0x04U << ADC_PSQ_PSN4_Pos)             /*!< 0x00020000 */
#define ADC_PSQ_PSN4_3                      (0x08U << ADC_PSQ_PSN4_Pos)             /*!< 0x00040000 */
#define ADC_PSQ_PSN4_4                      (0x10U << ADC_PSQ_PSN4_Pos)             /*!< 0x00080000 */

#define ADC_PSQ_PCLEN_Pos                   (20U)
#define ADC_PSQ_PCLEN_Msk                   (0x3U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00300000 */
#define ADC_PSQ_PCLEN                       ADC_PSQ_PCLEN_Msk                       /*!< PCLEN[1:0] bits (Preempted conversion sequence length) */
#define ADC_PSQ_PCLEN_0                     (0x1U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00100000 */
#define ADC_PSQ_PCLEN_1                     (0x2U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00200000 */

/*******************  Bit definition for ADC_PDT1 register  *******************/
#define ADC_PDT1_PDT1_Pos                   (0U)
#define ADC_PDT1_PDT1_Msk                   (0xFFFFU << ADC_PDT1_PDT1_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT1_PDT1                       ADC_PDT1_PDT1_Msk                       /*!< Conversion data from preempted channel 1 */

/*******************  Bit definition for ADC_PDT2 register  *******************/
#define ADC_PDT2_PDT2_Pos                   (0U)
#define ADC_PDT2_PDT2_Msk                   (0xFFFFU << ADC_PDT2_PDT2_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT2_PDT2                       ADC_PDT2_PDT2_Msk                       /*!< Conversion data from preempted channel 2 */

/*******************  Bit definition for ADC_PDT3 register  *******************/
#define ADC_PDT3_PDT3_Pos                   (0U)
#define ADC_PDT3_PDT3_Msk                   (0xFFFFU << ADC_PDT3_PDT3_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT3_PDT3                       ADC_PDT3_PDT3_Msk                       /*!< Conversion data from preempted channel 3 */

/*******************  Bit definition for ADC_PDT4 register  *******************/
#define ADC_PDT4_PDT4_Pos                   (0U)
#define ADC_PDT4_PDT4_Msk                   (0xFFFFU << ADC_PDT4_PDT4_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT4_PDT4                       ADC_PDT4_PDT4_Msk                       /*!< Conversion data from preempted channel 4 */

/*******************  Bit definition for ADC_ODT register  ********************/
#define ADC_ODT_ODT_Pos                     (0U)
#define ADC_ODT_ODT_Msk                     (0xFFFFU << ADC_ODT_ODT_Pos)            /*!< 0x0000FFFF */
#define ADC_ODT_ODT                         ADC_ODT_ODT_Msk                         /*!< Conversion data of ordinary channel */
#define ADC_ODT_ADC2ODT_Pos                 (16U)
#define ADC_ODT_ADC2ODT_Msk                 (0xFFFFU << ADC_ODT_ADC2ODT_Pos)        /*!< 0xFFFF0000 */
#define ADC_ODT_ADC2ODT                     ADC_ODT_ADC2ODT_Msk                     /*!< ADC2 conversion data of ordinary channel */

/******************************************************************************/
/*                                                                            */
/*                     Digital-to-analog converter (DAC)                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for DAC_CTRL register  *******************/
#define DAC_CTRL_D1EN_Pos                   (0U)
#define DAC_CTRL_D1EN_Msk                   (0x1U << DAC_CTRL_D1EN_Pos)             /*!< 0x00000001 */
#define DAC_CTRL_D1EN                       DAC_CTRL_D1EN_Msk                       /*!< DAC1 enable */
#define DAC_CTRL_D1OBDIS_Pos                (1U)
#define DAC_CTRL_D1OBDIS_Msk                (0x1U << DAC_CTRL_D1OBDIS_Pos)          /*!< 0x00000002 */
#define DAC_CTRL_D1OBDIS                    DAC_CTRL_D1OBDIS_Msk                    /*!< DAC1 output buffer disable */
#define DAC_CTRL_D1TRGEN_Pos                (2U)
#define DAC_CTRL_D1TRGEN_Msk                (0x1U << DAC_CTRL_D1TRGEN_Pos)          /*!< 0x00000004 */
#define DAC_CTRL_D1TRGEN                    DAC_CTRL_D1TRGEN_Msk                    /*!< DAC1 trigger enable */

#define DAC_CTRL_D1TRGSEL_Pos               (3U)
#define DAC_CTRL_D1TRGSEL_Msk               (0x7U << DAC_CTRL_D1TRGSEL_Pos)         /*!< 0x00000038 */
#define DAC_CTRL_D1TRGSEL                   DAC_CTRL_D1TRGSEL_Msk                   /*!< D1TRGSEL[2:0] (DAC1 trigger select) */
#define DAC_CTRL_D1TRGSEL_0                 (0x1U << DAC_CTRL_D1TRGSEL_Pos)         /*!< 0x00000008 */
#define DAC_CTRL_D1TRGSEL_1                 (0x2U << DAC_CTRL_D1TRGSEL_Pos)         /*!< 0x00000010 */
#define DAC_CTRL_D1TRGSEL_2                 (0x4U << DAC_CTRL_D1TRGSEL_Pos)         /*!< 0x00000020 */

