HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define USB_EPT7_TXSTS_Pos                  (4U)
#define USB_EPT7_TXSTS_Msk                  (0x3U << USB_EPT7_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT7_TXSTS                      USB_EPT7_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT7_TXSTS_0                    (0x1U << USB_EPT7_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT7_TXSTS_1                    (0x2U << USB_EPT7_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT7_TXDTS_Pos                  (6U)
#define USB_EPT7_TXDTS_Msk                  (0x1U << USB_EPT7_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT7_TXDTS                      USB_EPT7_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT7_TXTC_Pos                   (7U)
#define USB_EPT7_TXTC_Msk                   (0x1U << USB_EPT7_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT7_TXTC                       USB_EPT7_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT7_EXF_Pos                    (8U)
#define USB_EPT7_EXF_Msk                    (0x1U << USB_EPT7_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT7_EXF                        USB_EPT7_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT7_TRANS_TYPE_Pos             (9U)
#define USB_EPT7_TRANS_TYPE_Msk             (0x3U << USB_EPT7_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT7_TRANS_TYPE                 USB_EPT7_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT7_TRANS_TYPE_0               (0x1U << USB_EPT7_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT7_TRANS_TYPE_1               (0x2U << USB_EPT7_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT7_SETUPTC_Pos                (11U)
#define USB_EPT7_SETUPTC_Msk                (0x1U << USB_EPT7_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT7_SETUPTC                    USB_EPT7_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT7_RXSTS_Pos                  (12U)
#define USB_EPT7_RXSTS_Msk                  (0x3U << USB_EPT7_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT7_RXSTS                      USB_EPT7_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT7_RXSTS_0                    (0x1U << USB_EPT7_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT7_RXSTS_1                    (0x2U << USB_EPT7_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT7_RXDTS_Pos                  (14U)
#define USB_EPT7_RXDTS_Msk                  (0x1U << USB_EPT7_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT7_RXDTS                      USB_EPT7_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT7_RXTC_Pos                   (15U)
#define USB_EPT7_RXTC_Msk                   (0x1U << USB_EPT7_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT7_RXTC                       USB_EPT7_RXTC_Msk                       /*!< Rx transaction completed */

/*!< Common registers */
/*******************  Bit definition for USB_CTRL register  *******************/
#define USB_CTRL_CSRST_Pos                  (0U)
#define USB_CTRL_CSRST_Msk                  (0x1U << USB_CTRL_CSRST_Pos)            /*!< 0x00000001 */
#define USB_CTRL_CSRST                      USB_CTRL_CSRST_Msk                      /*!< Core soft Reset */
#define USB_CTRL_DISUSB_Pos                 (1U)
#define USB_CTRL_DISUSB_Msk                 (0x1U << USB_CTRL_DISUSB_Pos)           /*!< 0x00000002 */
#define USB_CTRL_DISUSB                     USB_CTRL_DISUSB_Msk                     /*!< Disble USB PHY */
#define USB_CTRL_LPM_Pos                    (2U)
#define USB_CTRL_LPM_Msk                    (0x1U << USB_CTRL_LPM_Pos)              /*!< 0x00000004 */
#define USB_CTRL_LPM                        USB_CTRL_LPM_Msk                        /*!< Low power mode */
#define USB_CTRL_SSP_Pos                    (3U)
#define USB_CTRL_SSP_Msk                    (0x1U << USB_CTRL_SSP_Pos)              /*!< 0x00000008 */
#define USB_CTRL_SSP                        USB_CTRL_SSP_Msk                        /*!< Software suspend config */
#define USB_CTRL_GRESUME_Pos                (4U)
#define USB_CTRL_GRESUME_Msk                (0x1U << USB_CTRL_GRESUME_Pos)          /*!< 0x00000010 */
#define USB_CTRL_GRESUME                    USB_CTRL_GRESUME_Msk                    /*!< Generate resume request */
#define USB_CTRL_LSOFIEN_Pos                (8U)
#define USB_CTRL_LSOFIEN_Msk                (0x1U << USB_CTRL_LSOFIEN_Pos)          /*!< 0x00000100 */
#define USB_CTRL_LSOFIEN                    USB_CTRL_LSOFIEN_Msk                    /*!< Lost start of frame interrupt enable */
#define USB_CTRL_SOFIEN_Pos                 (9U)
#define USB_CTRL_SOFIEN_Msk                 (0x1U << USB_CTRL_SOFIEN_Pos)           /*!< 0x00000200 */
#define USB_CTRL_SOFIEN                     USB_CTRL_SOFIEN_Msk                     /*!< Start of frame interrupt enable */
#define USB_CTRL_RSTIEN_Pos                 (10U)
#define USB_CTRL_RSTIEN_Msk                 (0x1U << USB_CTRL_RSTIEN_Pos)           /*!< 0x00000400 */
#define USB_CTRL_RSTIEN                     USB_CTRL_RSTIEN_Msk                     /*!< Bus reset interrupt enable */
#define USB_CTRL_SPIEN_Pos                  (11U)
#define USB_CTRL_SPIEN_Msk                  (0x1U << USB_CTRL_SPIEN_Pos)            /*!< 0x00000800 */
#define USB_CTRL_SPIEN                      USB_CTRL_SPIEN_Msk                      /*!< Bus suspend interrupt enable */
#define USB_CTRL_WKIEN_Pos                  (12U)
#define USB_CTRL_WKIEN_Msk                  (0x1U << USB_CTRL_WKIEN_Pos)            /*!< 0x00001000 */
#define USB_CTRL_WKIEN                      USB_CTRL_WKIEN_Msk                      /*!< Wakeup/Remote wakeup interrupt enable */
#define USB_CTRL_BEIEN_Pos                  (13U)
#define USB_CTRL_BEIEN_Msk                  (0x1U << USB_CTRL_BEIEN_Pos)            /*!< 0x00002000 */
#define USB_CTRL_BEIEN                      USB_CTRL_BEIEN_Msk                      /*!< Bus error interrupt enable */
#define USB_CTRL_UCFORIEN_Pos               (14U)
#define USB_CTRL_UCFORIEN_Msk               (0x1U << USB_CTRL_UCFORIEN_Pos)         /*!< 0x00004000 */
#define USB_CTRL_UCFORIEN                   USB_CTRL_UCFORIEN_Msk                   /*!< USB Core fifo overrun interrupt enable */
#define USB_CTRL_TCIEN_Pos                  (15U)
#define USB_CTRL_TCIEN_Msk                  (0x1U << USB_CTRL_TCIEN_Pos)            /*!< 0x00008000 */
#define USB_CTRL_TCIEN                      USB_CTRL_TCIEN_Msk                      /*!< Transmission complete interrupt enable */

/******************  Bit definition for USB_INTSTS register  ******************/
#define USB_INTSTS_EPT_NUM_Pos              (0U)
#define USB_INTSTS_EPT_NUM_Msk              (0xFU << USB_INTSTS_EPT_NUM_Pos)        /*!< 0x0000000F */
#define USB_INTSTS_EPT_NUM                  USB_INTSTS_EPT_NUM_Msk                  /*!< Endpoint number */
#define USB_INTSTS_INOUT_Pos                (4U)
#define USB_INTSTS_INOUT_Msk                (0x1U << USB_INTSTS_INOUT_Pos)          /*!< 0x00000010 */
#define USB_INTSTS_INOUT                    USB_INTSTS_INOUT_Msk                    /*!< IN/OUT transaction */
#define USB_INTSTS_LSOF_Pos                 (8U)
#define USB_INTSTS_LSOF_Msk                 (0x1U << USB_INTSTS_LSOF_Pos)           /*!< 0x00000100 */
#define USB_INTSTS_LSOF                     USB_INTSTS_LSOF_Msk                     /*!< Lost start of frame */
#define USB_INTSTS_SOF_Pos                  (9U)
#define USB_INTSTS_SOF_Msk                  (0x1U << USB_INTSTS_SOF_Pos)            /*!< 0x00000200 */
#define USB_INTSTS_SOF                      USB_INTSTS_SOF_Msk                      /*!< Start of frame */
#define USB_INTSTS_RST_Pos                  (10U)
#define USB_INTSTS_RST_Msk                  (0x1U << USB_INTSTS_RST_Pos)            /*!< 0x00000400 */
#define USB_INTSTS_RST                      USB_INTSTS_RST_Msk                      /*!< Bus reset */
#define USB_INTSTS_SP_Pos                   (11U)
#define USB_INTSTS_SP_Msk                   (0x1U << USB_INTSTS_SP_Pos)             /*!< 0x00000800 */
#define USB_INTSTS_SP                       USB_INTSTS_SP_Msk                       /*!< Bus suspend */
#define USB_INTSTS_WK_Pos                   (12U)
#define USB_INTSTS_WK_Msk                   (0x1U << USB_INTSTS_WK_Pos)             /*!< 0x00001000 */
#define USB_INTSTS_WK                       USB_INTSTS_WK_Msk                       /*!< Bus Wakeup */
#define USB_INTSTS_BE_Pos                   (13U)
#define USB_INTSTS_BE_Msk                   (0x1U << USB_INTSTS_BE_Pos)             /*!< 0x00002000 */
#define USB_INTSTS_BE                       USB_INTSTS_BE_Msk                       /*!< Bus error */
#define USB_INTSTS_UCFOR_Pos                (14U)
#define USB_INTSTS_UCFOR_Msk                (0x1U << USB_INTSTS_UCFOR_Pos)          /*!< 0x00004000 */
#define USB_INTSTS_UCFOR                    USB_INTSTS_UCFOR_Msk                    /*!< USB Core fifo overrun */
#define USB_INTSTS_TC_Pos                   (15U)
#define USB_INTSTS_TC_Msk                   (0x1U << USB_INTSTS_TC_Pos)             /*!< 0x00008000 */
#define USB_INTSTS_TC                       USB_INTSTS_TC_Msk                       /*!< Transaction completed */

