HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/******************  Bit definition for USB_R2LEN register  *******************/
#define USB_R2LEN_R2LEN_Pos                 (0U)
#define USB_R2LEN_R2LEN_Msk                 (0x3FFU << USB_R2LEN_R2LEN_Pos)         /*!< 0x000003FF */
#define USB_R2LEN_R2LEN                     USB_R2LEN_R2LEN_Msk                     /*!< Reception Length 2 */

#define USB_R2LEN_NBLK_Pos                  (10U)
#define USB_R2LEN_NBLK_Msk                  (0x1FU << USB_R2LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R2LEN_NBLK                      USB_R2LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R2LEN_NBLK_0                    (0x01U << USB_R2LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R2LEN_NBLK_1                    (0x02U << USB_R2LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R2LEN_NBLK_2                    (0x04U << USB_R2LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R2LEN_NBLK_3                    (0x08U << USB_R2LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R2LEN_NBLK_4                    (0x10U << USB_R2LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R2LEN_BSIZE_Pos                 (15U)
#define USB_R2LEN_BSIZE_Msk                 (0x1U << USB_R2LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R2LEN_BSIZE                     USB_R2LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R3LEN register  *******************/
#define USB_R3LEN_R3LEN_Pos                 (0U)
#define USB_R3LEN_R3LEN_Msk                 (0x3FFU << USB_R3LEN_R3LEN_Pos)         /*!< 0x000003FF */
#define USB_R3LEN_R3LEN                     USB_R3LEN_R3LEN_Msk                     /*!< Reception Length 3 */

#define USB_R3LEN_NBLK_Pos                  (10U)
#define USB_R3LEN_NBLK_Msk                  (0x1FU << USB_R3LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R3LEN_NBLK                      USB_R3LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R3LEN_NBLK_0                    (0x01U << USB_R3LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R3LEN_NBLK_1                    (0x02U << USB_R3LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R3LEN_NBLK_2                    (0x04U << USB_R3LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R3LEN_NBLK_3                    (0x08U << USB_R3LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R3LEN_NBLK_4                    (0x10U << USB_R3LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R3LEN_BSIZE_Pos                 (15U)
#define USB_R3LEN_BSIZE_Msk                 (0x1U << USB_R3LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R3LEN_BSIZE                     USB_R3LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R4LEN register  *******************/
#define USB_R4LEN_R4LEN_Pos                 (0U)
#define USB_R4LEN_R4LEN_Msk                 (0x3FFU << USB_R4LEN_R4LEN_Pos)         /*!< 0x000003FF */
#define USB_R4LEN_R4LEN                     USB_R4LEN_R4LEN_Msk                     /*!< Reception Length 4 */

#define USB_R4LEN_NBLK_Pos                  (10U)
#define USB_R4LEN_NBLK_Msk                  (0x1FU << USB_R4LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R4LEN_NBLK                      USB_R4LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R4LEN_NBLK_0                    (0x01U << USB_R4LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R4LEN_NBLK_1                    (0x02U << USB_R4LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R4LEN_NBLK_2                    (0x04U << USB_R4LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R4LEN_NBLK_3                    (0x08U << USB_R4LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R4LEN_NBLK_4                    (0x10U << USB_R4LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R4LEN_BSIZE_Pos                 (15U)
#define USB_R4LEN_BSIZE_Msk                 (0x1U << USB_R4LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R4LEN_BSIZE                     USB_R4LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R5LEN register  *******************/
#define USB_R5LEN_R5LEN_Pos                 (0U)
#define USB_R5LEN_R5LEN_Msk                 (0x3FFU << USB_R5LEN_R5LEN_Pos)         /*!< 0x000003FF */
#define USB_R5LEN_R5LEN                     USB_R5LEN_R5LEN_Msk                     /*!< Reception Length 5 */

#define USB_R5LEN_NBLK_Pos                  (10U)
#define USB_R5LEN_NBLK_Msk                  (0x1FU << USB_R5LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R5LEN_NBLK                      USB_R5LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R5LEN_NBLK_0                    (0x01U << USB_R5LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R5LEN_NBLK_1                    (0x02U << USB_R5LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R5LEN_NBLK_2                    (0x04U << USB_R5LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R5LEN_NBLK_3                    (0x08U << USB_R5LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R5LEN_NBLK_4                    (0x10U << USB_R5LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R5LEN_BSIZE_Pos                 (15U)
#define USB_R5LEN_BSIZE_Msk                 (0x1U << USB_R5LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R5LEN_BSIZE                     USB_R5LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R6LEN register  *******************/
#define USB_R6LEN_R6LEN_Pos                 (0U)
#define USB_R6LEN_R6LEN_Msk                 (0x3FFU << USB_R6LEN_R6LEN_Pos)         /*!< 0x000003FF */
#define USB_R6LEN_R6LEN                     USB_R6LEN_R6LEN_Msk                     /*!< Reception Length 6 */

#define USB_R6LEN_NBLK_Pos                  (10U)
#define USB_R6LEN_NBLK_Msk                  (0x1FU << USB_R6LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R6LEN_NBLK                      USB_R6LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R6LEN_NBLK_0                    (0x01U << USB_R6LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R6LEN_NBLK_1                    (0x02U << USB_R6LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R6LEN_NBLK_2                    (0x04U << USB_R6LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R6LEN_NBLK_3                    (0x08U << USB_R6LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R6LEN_NBLK_4                    (0x10U << USB_R6LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R6LEN_BSIZE_Pos                 (15U)
#define USB_R6LEN_BSIZE_Msk                 (0x1U << USB_R6LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R6LEN_BSIZE                     USB_R6LEN_BSIZE_Msk                     /*!< Block size */

/******************  Bit definition for USB_R7LEN register  *******************/
#define USB_R7LEN_R7LEN_Pos                 (0U)
#define USB_R7LEN_R7LEN_Msk                 (0x3FFU << USB_R7LEN_R7LEN_Pos)         /*!< 0x000003FF */
#define USB_R7LEN_R7LEN                     USB_R7LEN_R7LEN_Msk                     /*!< Reception Length 7 */

