HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/********************  Bit definition for ACC_CP2 register  *******************/
#define ACC_CP2_C2_Pos                      (0U)
#define ACC_CP2_C2_Msk                      (0xFFFFU << ACC_CP2_C2_Pos)             /*!< 0x0000FFFF */
#define ACC_CP2_C2                          ACC_CP2_C2_Msk                          /*!< Compare 2 */

/********************  Bit definition for ACC_CP3 register  *******************/
#define ACC_CP3_C3_Pos                      (0U)
#define ACC_CP3_C3_Msk                      (0xFFFFU << ACC_CP3_C3_Pos)             /*!< 0x0000FFFF */
#define ACC_CP3_C3                          ACC_CP3_C3_Msk                          /*!< Compare 3 */

/******************************************************************************/
/*                                                                            */
/*                    Ethernet media access control (EMAC)                    */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for EMAC_MACCTRL register  *****************/
#define EMAC_MACCTRL_WD_Pos                 (23U)
#define EMAC_MACCTRL_WD_Msk                 (0x1U << EMAC_MACCTRL_WD_Pos)           /*!< 0x00800000 */
#define EMAC_MACCTRL_WD                     EMAC_MACCTRL_WD_Msk                     /*!< Watchdog Disable */
#define EMAC_MACCTRL_JD_Pos                 (22U)
#define EMAC_MACCTRL_JD_Msk                 (0x1U << EMAC_MACCTRL_JD_Pos)           /*!< 0x00400000 */
#define EMAC_MACCTRL_JD                     EMAC_MACCTRL_JD_Msk                     /*!< Jabber Disable */

/*!< IFG configuration */
#define EMAC_MACCTRL_IFG_Pos                (17U)
#define EMAC_MACCTRL_IFG_Msk                (0x7U << EMAC_MACCTRL_IFG_Pos)          /*!< 0x000E0000 */
#define EMAC_MACCTRL_IFG                    EMAC_MACCTRL_IFG_Msk                    /*!< InterFrame Gap */

#define EMAC_MACCTRL_IFG_96Bit              0x00000000U                             /*!< Minimum IFG between frames during transmission is 96 bit */
#define EMAC_MACCTRL_IFG_88Bit              0x00020000U                             /*!< Minimum IFG between frames during transmission is 88 bit */
#define EMAC_MACCTRL_IFG_80Bit              0x00040000U                             /*!< Minimum IFG between frames during transmission is 80 bit */
#define EMAC_MACCTRL_IFG_72Bit              0x00060000U                             /*!< Minimum IFG between frames during transmission is 72 bit */
#define EMAC_MACCTRL_IFG_64Bit              0x00080000U                             /*!< Minimum IFG between frames during transmission is 64 bit */
#define EMAC_MACCTRL_IFG_56Bit              0x000A0000U                             /*!< Minimum IFG between frames during transmission is 56 bit */
#define EMAC_MACCTRL_IFG_48Bit              0x000C0000U                             /*!< Minimum IFG between frames during transmission is 48 bit */
#define EMAC_MACCTRL_IFG_40Bit              0x000E0000U                             /*!< Minimum IFG between frames during transmission is 40 bit */
             
#define EMAC_MACCTRL_DCS_Pos                (16U)
#define EMAC_MACCTRL_DCS_Msk                (0x1U << EMAC_MACCTRL_DCS_Pos)          /*!< 0x00010000 */
#define EMAC_MACCTRL_DCS                    EMAC_MACCTRL_DCS_Msk                    /*!< Disable Carrier Sense */
#define EMAC_MACCTRL_FES_Pos                (14U)
#define EMAC_MACCTRL_FES_Msk                (0x1U << EMAC_MACCTRL_FES_Pos)          /*!< 0x00004000 */
#define EMAC_MACCTRL_FES                    EMAC_MACCTRL_FES_Msk                    /*!< Fast EMAC Speed */
#define EMAC_MACCTRL_DRO_Pos                (13U)
#define EMAC_MACCTRL_DRO_Msk                (0x1U << EMAC_MACCTRL_DRO_Pos)          /*!< 0x00002000 */
#define EMAC_MACCTRL_DRO                    EMAC_MACCTRL_DRO_Msk                    /*!< Disable Receive Own */
#define EMAC_MACCTRL_LM_Pos                 (12U)
#define EMAC_MACCTRL_LM_Msk                 (0x1U << EMAC_MACCTRL_LM_Pos)           /*!< 0x00001000 */
#define EMAC_MACCTRL_LM                     EMAC_MACCTRL_LM_Msk                     /*!< Loopback Mode */
#define EMAC_MACCTRL_DM_Pos                 (11U)
#define EMAC_MACCTRL_DM_Msk                 (0x1U << EMAC_MACCTRL_DM_Pos)           /*!< 0x00000800 */
#define EMAC_MACCTRL_DM                     EMAC_MACCTRL_DM_Msk                     /*!< Duplex Mode */
#define EMAC_MACCTRL_IPC_Pos                (10U)
#define EMAC_MACCTRL_IPC_Msk                (0x1U << EMAC_MACCTRL_IPC_Pos)          /*!< 0x00000400 */
#define EMAC_MACCTRL_IPC                    EMAC_MACCTRL_IPC_Msk                    /*!< IPv4 Checksum */
#define EMAC_MACCTRL_DR_Pos                 (9U)
#define EMAC_MACCTRL_DR_Msk                 (0x1U << EMAC_MACCTRL_DR_Pos)           /*!< 0x00000200 */
#define EMAC_MACCTRL_DR                     EMAC_MACCTRL_DR_Msk                     /*!< Disable Retry */
#define EMAC_MACCTRL_ACS_Pos                (7U)
#define EMAC_MACCTRL_ACS_Msk                (0x1U << EMAC_MACCTRL_ACS_Pos)          /*!< 0x00000080 */
#define EMAC_MACCTRL_ACS                    EMAC_MACCTRL_ACS_Msk                    /*!< Automatic pad / CRC Stripping */

/*!< BL configuration */
#define EMAC_MACCTRL_BL_Pos                 (5U)
#define EMAC_MACCTRL_BL_Msk                 (0x3U << EMAC_MACCTRL_BL_Pos)           /*!< 0x00000060 */
#define EMAC_MACCTRL_BL                     EMAC_MACCTRL_BL_Msk                     /*!< Back-off Limit: Random integer number (r) of s lot
                                                                                         time delays before rescheduling a transmission attempt
                                                                                         during retries after a collision: 0 = < r < 2 ^ k */

#define EMAC_MACCTRL_BL_10                  0x00000000U                             /*!< k = min (n, 10) */
#define EMAC_MACCTRL_BL_8                   0x00000020U                             /*!< k = min (n, 8) */
#define EMAC_MACCTRL_BL_4                   0x00000040U                             /*!< k = min (n, 4) */
#define EMAC_MACCTRL_BL_1                   0x00000060U                             /*!< k = min (n, 1) */

#define EMAC_MACCTRL_DC_Pos                 (4U)
#define EMAC_MACCTRL_DC_Msk                 (0x1U << EMAC_MACCTRL_DC_Pos)           /*!< 0x00000010 */
#define EMAC_MACCTRL_DC                     EMAC_MACCTRL_DC_Msk                     /*!< Deferral Check */
#define EMAC_MACCTRL_TE_Pos                 (3U)
#define EMAC_MACCTRL_TE_Msk                 (0x1U << EMAC_MACCTRL_TE_Pos)           /*!< 0x00000008 */
#define EMAC_MACCTRL_TE                     EMAC_MACCTRL_TE_Msk                     /*!< Transmitter Enable */
#define EMAC_MACCTRL_RE_Pos                 (2U)
#define EMAC_MACCTRL_RE_Msk                 (0x1U << EMAC_MACCTRL_RE_Pos)           /*!< 0x00000004 */
#define EMAC_MACCTRL_RE                     EMAC_MACCTRL_RE_Msk                     /*!< Receiver Enable */

/*****************  Bit definition for EMAC_MACFRMF register  *****************/
#define EMAC_MACFRMF_RA_Pos                 (31U)
#define EMAC_MACFRMF_RA_Msk                 (0x1U << EMAC_MACFRMF_RA_Pos)           /*!< 0x80000000 */
#define EMAC_MACFRMF_RA                     EMAC_MACFRMF_RA_Msk                     /*!< Receive All */
#define EMAC_MACFRMF_HPF_Pos                (10U)
#define EMAC_MACFRMF_HPF_Msk                (0x1U << EMAC_MACFRMF_HPF_Pos)          /*!< 0x00000400 */
#define EMAC_MACFRMF_HPF                    EMAC_MACFRMF_HPF_Msk                    /*!< Hash or Perfect Filter */
#define EMAC_MACFRMF_SAF_Pos                (9U)
#define EMAC_MACFRMF_SAF_Msk                (0x1U << EMAC_MACFRMF_SAF_Pos)          /*!< 0x00000200 */
#define EMAC_MACFRMF_SAF                    EMAC_MACFRMF_SAF_Msk                    /*!< Source Address Filter */
#define EMAC_MACFRMF_SAIF_Pos               (8U)
#define EMAC_MACFRMF_SAIF_Msk               (0x1U << EMAC_MACFRMF_SAIF_Pos)         /*!< 0x00000100 */
#define EMAC_MACFRMF_SAIF                   EMAC_MACFRMF_SAIF_Msk                   /*!< Source Address Inverse Filtering */

/*!< PCF configuration */
#define EMAC_MACFRMF_PCF_Pos                (6U)
#define EMAC_MACFRMF_PCF_Msk                (0x3U << EMAC_MACFRMF_PCF_Pos)          /*!< 0x000000C0 */
#define EMAC_MACFRMF_PCF                    EMAC_MACFRMF_PCF_Msk                    /*!< Pass Control Frames */

#define EMAC_MACFRMF_PCF_BlockAll           0x00000000U                             /*!< MAC filters all control frames and prevents
                                                                                         them from reaching the application */
#define EMAC_MACFRMF_PCF_BlockAllPause_Pos  (6U)                                    /*!< 0x00000040 */
#define EMAC_MACFRMF_PCF_BlockAllPause_Msk  (0x1U << EMAC_MACFRMF_PCF_BlockAllPause_Pos)
#define EMAC_MACFRMF_PCF_BlockAllPause      EMAC_MACFRMF_PCF_BlockAllPause_Msk      /*!< MAC forwards all control frames, except Pause frame,
                                                                                         to the application even if they fail the address filter */
#define EMAC_MACFRMF_PCF_ForwardAll_Pos     (7U)                                    /*!< 0x00000080 */
#define EMAC_MACFRMF_PCF_ForwardAll_Msk     (0x1U << EMAC_MACFRMF_PCF_ForwardAll_Pos)
#define EMAC_MACFRMF_PCF_ForwardAll         EMAC_MACFRMF_PCF_ForwardAll_Msk         /*!< MAC forwards all control frames to the application
                                                                                         even if they fail the address filter */
#define EMAC_MACFRMF_PCF_ForwardAddr_Pos    (6U)                                    /*!< 0x000000C0 */
#define EMAC_MACFRMF_PCF_ForwardAddr_Msk    (0x3U << EMAC_MACFRMF_PCF_ForwardAddr_Pos)
#define EMAC_MACFRMF_PCF_ForwardAddr        EMAC_MACFRMF_PCF_ForwardAddr_Msk        /*!< MAC forwards control frames that pass the address
                                                                                         filter to the application */

