HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define EMAC_MACFRMF_DBF_Pos                (5U)
#define EMAC_MACFRMF_DBF_Msk                (0x1U << EMAC_MACFRMF_DBF_Pos)          /*!< 0x00000020 */
#define EMAC_MACFRMF_DBF                    EMAC_MACFRMF_DBF_Msk                    /*!< Disable Broadcast Frames */
#define EMAC_MACFRMF_PMC_Pos                (4U)
#define EMAC_MACFRMF_PMC_Msk                (0x1U << EMAC_MACFRMF_PMC_Pos)          /*!< 0x00000010 */
#define EMAC_MACFRMF_PMC                    EMAC_MACFRMF_PMC_Msk                    /*!< Pass MultiCast */
#define EMAC_MACFRMF_DAIF_Pos               (3U)
#define EMAC_MACFRMF_DAIF_Msk               (0x1U << EMAC_MACFRMF_DAIF_Pos)         /*!< 0x00000008 */
#define EMAC_MACFRMF_DAIF                   EMAC_MACFRMF_DAIF_Msk                   /*!< Destination Address Inverse Filtering */
#define EMAC_MACFRMF_HMC_Pos                (2U)
#define EMAC_MACFRMF_HMC_Msk                (0x1U << EMAC_MACFRMF_HMC_Pos)          /*!< 0x00000004 */
#define EMAC_MACFRMF_HMC                    EMAC_MACFRMF_HMC_Msk                    /*!< Hash MultiCast */
#define EMAC_MACFRMF_HUC_Pos                (1U)
#define EMAC_MACFRMF_HUC_Msk                (0x1U << EMAC_MACFRMF_HUC_Pos)          /*!< 0x00000002 */
#define EMAC_MACFRMF_HUC                    EMAC_MACFRMF_HUC_Msk                    /*!< Hash UniCast */
#define EMAC_MACFRMF_PR_Pos                 (0U)
#define EMAC_MACFRMF_PR_Msk                 (0x1U << EMAC_MACFRMF_PR_Pos)           /*!< 0x00000001 */
#define EMAC_MACFRMF_PR                     EMAC_MACFRMF_PR_Msk                     /*!< Promiscuous Mode */

/*****************  Bit definition for EMAC_MACHTH register  ******************/
#define EMAC_MACHTH_HTH_Pos                 (0U)
#define EMAC_MACHTH_HTH_Msk                 (0xFFFFFFFFU << EMAC_MACHTH_HTH_Pos)    /*!< 0xFFFFFFFF */
#define EMAC_MACHTH_HTH                     EMAC_MACHTH_HTH_Msk                     /*!< Hash Table High */

/*****************  Bit definition for EMAC_MACHTL register  ******************/
#define EMAC_MACHTL_HTL_Pos                 (0U)
#define EMAC_MACHTL_HTL_Msk                 (0xFFFFFFFFU << EMAC_MACHTL_HTL_Pos)    /*!< 0xFFFFFFFF */
#define EMAC_MACHTL_HTL                     EMAC_MACHTL_HTL_Msk                     /*!< Hash Table Low */

/***************  Bit definition for EMAC_MACMIIADDR register  ****************/
#define EMAC_MACMIIADDR_PA_Pos              (11U)
#define EMAC_MACMIIADDR_PA_Msk              (0x1FU << EMAC_MACMIIADDR_PA_Pos)       /*!< 0x0000F800 */
#define EMAC_MACMIIADDR_PA                  EMAC_MACMIIADDR_PA_Msk                  /*!< PHY Address */
#define EMAC_MACMIIADDR_MII_Pos             (6U)
#define EMAC_MACMIIADDR_MII_Msk             (0x1FU << EMAC_MACMIIADDR_MII_Pos)      /*!< 0x000007C0 */
#define EMAC_MACMIIADDR_MII                 EMAC_MACMIIADDR_MII_Msk                 /*!< MII Register */

/*!< CR configuration */
#define EMAC_MACMIIADDR_CR_Pos              (2U)
#define EMAC_MACMIIADDR_CR_Msk              (0x7U << EMAC_MACMIIADDR_CR_Pos)        /*!< 0x0000001C */
#define EMAC_MACMIIADDR_CR                  EMAC_MACMIIADDR_CR_Msk                  /*!< Clock Range */

#define EMAC_MACMIIADDR_CR_DIV42            0x00000000U                             /*!< CSR clock frequency is 60 – 100 MHz, and
                                                                                         MDC clock frequency is CSR clock / 42 */
#define EMAC_MACMIIADDR_CR_DIV62_Pos        (2U)
#define EMAC_MACMIIADDR_CR_DIV62_Msk        (0x1U << EMAC_MACMIIADDR_CR_DIV62_Pos)  /*!< 0x00000004 */
#define EMAC_MACMIIADDR_CR_DIV62            EMAC_MACMIIADDR_CR_DIV62_Msk            /*!< CSR clock frequency is 100 – 150 MHz, and
                                                                                         MDC clock frequency is CSR clock / 62 */
#define EMAC_MACMIIADDR_CR_DIV16_Pos        (3U)
#define EMAC_MACMIIADDR_CR_DIV16_Msk        (0x1U << EMAC_MACMIIADDR_CR_DIV16_Pos)  /*!< 0x00000008 */
#define EMAC_MACMIIADDR_CR_DIV16            EMAC_MACMIIADDR_CR_DIV16_Msk            /*!< CSR clock frequency is 20 – 35 MHz, and
                                                                                         MDC clock frequency is CSR clock / 16 */
#define EMAC_MACMIIADDR_CR_DIV26_Pos        (2U)
#define EMAC_MACMIIADDR_CR_DIV26_Msk        (0x3U << EMAC_MACMIIADDR_CR_DIV26_Pos)  /*!< 0x0000000C */
#define EMAC_MACMIIADDR_CR_DIV26            EMAC_MACMIIADDR_CR_DIV26_Msk            /*!< CSR clock frequency is 35 – 60 MHz, and
                                                                                         MDC clock frequency is CSR clock / 26 */
#define EMAC_MACMIIADDR_CR_DIV102_Pos       (4U)
#define EMAC_MACMIIADDR_CR_DIV102_Msk       (0x1U << EMAC_MACMIIADDR_CR_DIV102_Pos) /*!< 0x00000010 */
#define EMAC_MACMIIADDR_CR_DIV102           EMAC_MACMIIADDR_CR_DIV102_Msk           /*!< CSR clock frequency is 150 – 250 MHz, and
                                                                                         MDC clock frequency is CSR clock / 102 */
#define EMAC_MACMIIADDR_CR_DIV124_Pos       (2U)
#define EMAC_MACMIIADDR_CR_DIV124_Msk       (0x5U << EMAC_MACMIIADDR_CR_DIV124_Pos) /*!< 0x00000014 */
#define EMAC_MACMIIADDR_CR_DIV124           EMAC_MACMIIADDR_CR_DIV124_Msk           /*!< CSR clock frequency is 250 – 300 MHz, and
                                                                                         MDC clock frequency is CSR clock / 124 */

#define EMAC_MACMIIADDR_MW_Pos              (1U)
#define EMAC_MACMIIADDR_MW_Msk              (0x1U << EMAC_MACMIIADDR_MW_Pos)        /*!< 0x00000002 */
#define EMAC_MACMIIADDR_MW                  EMAC_MACMIIADDR_MW_Msk                  /*!< MII Write */
#define EMAC_MACMIIADDR_MB_Pos              (0U)
#define EMAC_MACMIIADDR_MB_Msk              (0x1U << EMAC_MACMIIADDR_MB_Pos)        /*!< 0x00000001 */
#define EMAC_MACMIIADDR_MB                  EMAC_MACMIIADDR_MB_Msk                  /*!< MII Busy */

/****************  Bit definition for EMAC_MACMIIDT register  *****************/
#define EMAC_MACMIIDT_MD_Pos                (0U)
#define EMAC_MACMIIDT_MD_Msk                (0xFFFFU << EMAC_MACMIIDT_MD_Pos)       /*!< 0x0000FFFF */
#define EMAC_MACMIIDT_MD                    EMAC_MACMIIDT_MD_Msk                    /*!< MII Data */

