HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
#define EMAC_MACA1H_MA1H_Pos                (0U)
#define EMAC_MACA1H_MA1H_Msk                (0xFFFFU << EMAC_MACA1H_MA1H_Pos)       /*!< 0x0000FFFF */
#define EMAC_MACA1H_MA1H                    EMAC_MACA1H_MA1H_Msk                    /*!< MAC Address 1 High */

/*****************  Bit definition for EMAC_MACA1L register  ******************/
#define EMAC_MACA1L_MA1L_Pos                (0U)
#define EMAC_MACA1L_MA1L_Msk                (0xFFFFFFFFU << EMAC_MACA1L_MA1L_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_MACA1L_MA1L                    EMAC_MACA1L_MA1L_Msk                    /*!< MAC Address 1 Low */

/*****************  Bit definition for EMAC_MACA2H register  ******************/
#define EMAC_MACA2H_AE_Pos                  (31U)
#define EMAC_MACA2H_AE_Msk                  (0x1U << EMAC_MACA2H_AE_Pos)            /*!< 0x80000000 */
#define EMAC_MACA2H_AE                      EMAC_MACA2H_AE_Msk                      /*!< Address Enable */
#define EMAC_MACA2H_SA_Pos                  (30U)
#define EMAC_MACA2H_SA_Msk                  (0x1U << EMAC_MACA2H_SA_Pos)            /*!< 0x40000000 */
#define EMAC_MACA2H_SA                      EMAC_MACA2H_SA_Msk                      /*!< Source Address */

/*!< MBC configuration */
#define EMAC_MACA2H_MBC_Pos                 (24U)
#define EMAC_MACA2H_MBC_Msk                 (0x3FU << EMAC_MACA2H_MBC_Pos)          /*!< 0x3F000000 */
#define EMAC_MACA2H_MBC                     EMAC_MACA2H_MBC_Msk                     /*!< Mask Byte Control */

#define EMAC_MACA2H_MBC_HBits15_8           0x20000000U                             /*!< EMAC_MACA2H [15:8] */
#define EMAC_MACA2H_MBC_HBits7_0            0x10000000U                             /*!< EMAC_MACA2H [7:0] */
#define EMAC_MACA2H_MBC_LBits31_24          0x08000000U                             /*!< EMAC_MACA2L [31:24] */
#define EMAC_MACA2H_MBC_LBits23_16          0x04000000U                             /*!< EMAC_MACA2L [23:16] */
#define EMAC_MACA2H_MBC_LBits15_8           0x02000000U                             /*!< EMAC_MACA2L [15:8] */
#define EMAC_MACA2H_MBC_LBits7_0            0x01000000U                             /*!< EMAC_MACA2L [7:0] */

#define EMAC_MACA2H_MA2H_Pos                (0U)
#define EMAC_MACA2H_MA2H_Msk                (0xFFFFU << EMAC_MACA2H_MA2H_Pos)       /*!< 0x0000FFFF */
#define EMAC_MACA2H_MA2H                    EMAC_MACA2H_MA2H_Msk                    /*!< MAC Address 2 High */

/*****************  Bit definition for EMAC_MACA2L register  ******************/
#define EMAC_MACA2L_MA2L_Pos                (0U)
#define EMAC_MACA2L_MA2L_Msk                (0xFFFFFFFFU << EMAC_MACA2L_MA2L_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_MACA2L_MA2L                    EMAC_MACA2L_MA2L_Msk                    /*!< MAC Address 2 Low */

/*****************  Bit definition for EMAC_MACA3H register  ******************/
#define EMAC_MACA3H_AE_Pos                  (31U)
#define EMAC_MACA3H_AE_Msk                  (0x1U << EMAC_MACA3H_AE_Pos)            /*!< 0x80000000 */
#define EMAC_MACA3H_AE                      EMAC_MACA3H_AE_Msk                      /*!< Address Enable */
#define EMAC_MACA3H_SA_Pos                  (30U)
#define EMAC_MACA3H_SA_Msk                  (0x1U << EMAC_MACA3H_SA_Pos)            /*!< 0x40000000 */
#define EMAC_MACA3H_SA                      EMAC_MACA3H_SA_Msk                      /*!< Source Address */

/*!< MBC configuration */
#define EMAC_MACA3H_MBC_Pos                 (24U)
#define EMAC_MACA3H_MBC_Msk                 (0x3FU << EMAC_MACA3H_MBC_Pos)          /*!< 0x3F000000 */
#define EMAC_MACA3H_MBC                     EMAC_MACA3H_MBC_Msk                     /*!< Mask Byte Control */

#define EMAC_MACA3H_MBC_HBits15_8           0x20000000U                             /*!< EMAC_MACA3H [15:8] */
#define EMAC_MACA3H_MBC_HBits7_0            0x10000000U                             /*!< EMAC_MACA3H [7:0] */
#define EMAC_MACA3H_MBC_LBits31_24          0x08000000U                             /*!< EMAC_MACA3L [31:24] */
#define EMAC_MACA3H_MBC_LBits23_16          0x04000000U                             /*!< EMAC_MACA3L [23:16] */
#define EMAC_MACA3H_MBC_LBits15_8           0x02000000U                             /*!< EMAC_MACA3L [15:8] */
#define EMAC_MACA3H_MBC_LBits7_0            0x01000000U                             /*!< EMAC_MACA3L [7:0] */

#define EMAC_MACA3H_MA3H_Pos                (0U)
#define EMAC_MACA3H_MA3H_Msk                (0xFFFFU << EMAC_MACA3H_MA3H_Pos)       /*!< 0x0000FFFF */
#define EMAC_MACA3H_MA3H                    EMAC_MACA3H_MA3H_Msk                    /*!< MAC Address 3 High */

/*****************  Bit definition for EMAC_MACA3L register  ******************/
#define EMAC_MACA3L_MA3L_Pos                (0U)
#define EMAC_MACA3L_MA3L_Msk                (0xFFFFFFFFU << EMAC_MACA3L_MA3L_Pos)   /*!< 0xFFFFFFFF */
#define EMAC_MACA3L_MA3L                    EMAC_MACA3L_MA3L_Msk                    /*!< MAC Address 3 Low */

/*****************  Bit definition for EMAC_MMCCTRL register  *****************/
#define EMAC_MMCCTRL_FMC_Pos                (3U)
#define EMAC_MMCCTRL_FMC_Msk                (0x1U << EMAC_MMCCTRL_FMC_Pos)          /*!< 0x00000008 */
#define EMAC_MMCCTRL_FMC                    EMAC_MMCCTRL_FMC_Msk                    /*!< Freeze MMC Counter */
#define EMAC_MMCCTRL_RR_Pos                 (2U)
#define EMAC_MMCCTRL_RR_Msk                 (0x1U << EMAC_MMCCTRL_RR_Pos)           /*!< 0x00000004 */
#define EMAC_MMCCTRL_RR                     EMAC_MMCCTRL_RR_Msk                     /*!< Reset on Read */
#define EMAC_MMCCTRL_SCR_Pos                (1U)
#define EMAC_MMCCTRL_SCR_Msk                (0x1U << EMAC_MMCCTRL_SCR_Pos)          /*!< 0x00000002 */
#define EMAC_MMCCTRL_SCR                    EMAC_MMCCTRL_SCR_Msk                    /*!< Stop Counter Rollover */
#define EMAC_MMCCTRL_RC_Pos                 (0U)
#define EMAC_MMCCTRL_RC_Msk                 (0x1U << EMAC_MMCCTRL_RC_Pos)           /*!< 0x00000001 */
#define EMAC_MMCCTRL_RC                     EMAC_MMCCTRL_RC_Msk                     /*!< Reset Counter */

/******************  Bit definition for EMAC_MMCRI register  ******************/
#define EMAC_MMCRI_RGUF_Pos                 (17U)
#define EMAC_MMCRI_RGUF_Msk                 (0x1U << EMAC_MMCRI_RGUF_Pos)           /*!< 0x00020000 */
#define EMAC_MMCRI_RGUF                     EMAC_MMCRI_RGUF_Msk                     /*!< Received Good Unicast Frames */
#define EMAC_MMCRI_RFAE_Pos                 (6U)
#define EMAC_MMCRI_RFAE_Msk                 (0x1U << EMAC_MMCRI_RFAE_Pos)           /*!< 0x00000040 */
#define EMAC_MMCRI_RFAE                     EMAC_MMCRI_RFAE_Msk                     /*!< Received Frames Alignment Error */
#define EMAC_MMCRI_RFCE_Pos                 (5U)
#define EMAC_MMCRI_RFCE_Msk                 (0x1U << EMAC_MMCRI_RFCE_Pos)           /*!< 0x00000020 */
#define EMAC_MMCRI_RFCE                     EMAC_MMCRI_RFCE_Msk                     /*!< Received Frames CRC Error */

