HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/*!< EB configuration */
#define EMAC_DMASTS_EB_Pos                  (23U)
#define EMAC_DMASTS_EB_Msk                  (0x7U << EMAC_DMASTS_EB_Pos)            /*!< 0x03800000 */
#define EMAC_DMASTS_EB                      EMAC_DMASTS_EB_Msk                      /*!< Error Bits */

/*!< Combination with EB[2:0] for GetFlagStatus function */
#define EMAC_DMASTS_EB_ReadAccessTx_Pos     (23U)                                   /*!< 0x03800000 */
#define EMAC_DMASTS_EB_ReadAccessTx_Msk     (0x7U << EMAC_DMASTS_EB_ReadAccessTx_Pos)
#define EMAC_DMASTS_EB_ReadAccessTx         EMAC_DMASTS_EB_ReadAccessTx_Msk         /*!< Error 111 Tx DMA descriptor read access */
#define EMAC_DMASTS_EB_ReadAccessRx_Pos     (24U)                                   /*!< 0x03000000 */
#define EMAC_DMASTS_EB_ReadAccessRx_Msk     (0x3U << EMAC_DMASTS_EB_ReadAccessRx_Pos)
#define EMAC_DMASTS_EB_ReadAccessRx         EMAC_DMASTS_EB_ReadAccessRx_Msk         /*!< Error 110 Rx DMA descriptor read access */
#define EMAC_DMASTS_EB_WriteAccessTx_Pos    (23U)                                   /*!< 0x02800000 */
#define EMAC_DMASTS_EB_WriteAccessTx_Msk    (0x5U << EMAC_DMASTS_EB_WriteAccessTx_Pos)
#define EMAC_DMASTS_EB_WriteAccessTx        EMAC_DMASTS_EB_WriteAccessTx_Msk        /*!< Error 101 Tx DMA descriptor write access */
#define EMAC_DMASTS_EB_WriteAccessRx_Pos    (25U)                                   /*!< 0x02000000 */
#define EMAC_DMASTS_EB_WriteAccessRx_Msk    (0x1U << EMAC_DMASTS_EB_WriteAccessRx_Pos)
#define EMAC_DMASTS_EB_WriteAccessRx        EMAC_DMASTS_EB_WriteAccessRx_Msk        /*!< Error 100 Rx DMA descriptor write access */
#define EMAC_DMASTS_EB_ReadTransfTx_Pos     (23U)                                   /*!< 0x01800000 */
#define EMAC_DMASTS_EB_ReadTransfTx_Msk     (0x3U << EMAC_DMASTS_EB_DataTransfTx_Pos)
#define EMAC_DMASTS_EB_ReadTransfTx         EMAC_DMASTS_EB_DataTransfTx_Msk         /*!< Error 011 during read transfer by Tx DMA */
#define EMAC_DMASTS_EB_DataTransfRx         0x00000000                              /*!< Error 000 during data transfer by Rx DMA */

/*!< TS configuration */
#define EMAC_DMASTS_TS_Pos                  (20U)
#define EMAC_DMASTS_TS_Msk                  (0x7U << EMAC_DMASTS_TS_Pos)            /*!< 0x00700000 */
#define EMAC_DMASTS_TS                      EMAC_DMASTS_TS_Msk                      /*!< Transmit Process State */

#define EMAC_DMASTS_TS_Stopped              0x00000000U                             /*!< Stopped - Rest or Stop transmit command issued */
#define EMAC_DMASTS_TS_Fetching_Pos         (20U)
#define EMAC_DMASTS_TS_Fetching_Msk         (0x1U << EMAC_DMASTS_TS_Fetching_Pos)   /*!< 0x00100000 */
#define EMAC_DMASTS_TS_Fetching             EMAC_DMASTS_TS_Fetching_Msk             /*!< Running - Fetching transmit descriptor */
#define EMAC_DMASTS_TS_Waiting_Pos          (21U)
#define EMAC_DMASTS_TS_Waiting_Msk          (0x1U << EMAC_DMASTS_TS_Waiting_Pos)    /*!< 0x00200000 */
#define EMAC_DMASTS_TS_Waiting              EMAC_DMASTS_TS_Waiting_Msk              /*!< Running - Waiting for status */
#define EMAC_DMASTS_TS_Reading_Pos          (20U)
#define EMAC_DMASTS_TS_Reading_Msk          (0x3U << EMAC_DMASTS_TS_Reading_Pos)    /*!< 0x00300000 */
#define EMAC_DMASTS_TS_Reading              EMAC_DMASTS_TS_Reading_Msk              /*!< Running - Reading data from host memory */
#define EMAC_DMASTS_TS_TimeWrite_Pos        (22U)
#define EMAC_DMASTS_TS_TimeWrite_Msk        (0x1U << EMAC_DMASTS_TS_TimeWrite_Pos)  /*!< 0x00400000 */
#define EMAC_DMASTS_TS_TimeWrite            EMAC_DMASTS_TS_TimeWrite_Msk            /*!< Time stamp write status */
#define EMAC_DMASTS_TS_Suspended_Pos        (21U)
#define EMAC_DMASTS_TS_Suspended_Msk        (0x3U << EMAC_DMASTS_TS_Suspended_Pos)  /*!< 0x00600000 */
#define EMAC_DMASTS_TS_Suspended            EMAC_DMASTS_TS_Suspended_Msk            /*!< Suspended - Transmit descriptor unavailabe */
#define EMAC_DMASTS_TS_Closing_Pos          (20U)
#define EMAC_DMASTS_TS_Closing_Msk          (0x7U << EMAC_DMASTS_TS_Closing_Pos)    /*!< 0x00700000 */
#define EMAC_DMASTS_TS_Closing              EMAC_DMASTS_TS_Closing_Msk              /*!< Running - Closing transmit descriptor */

/*!< RS configuration */
#define EMAC_DMASTS_RS_Pos                  (17U)
#define EMAC_DMASTS_RS_Msk                  (0x7U << EMAC_DMASTS_RS_Pos)            /*!< 0x000E0000 */
#define EMAC_DMASTS_RS                      EMAC_DMASTS_RS_Msk                      /*!< Receive process state */

#define EMAC_DMASTS_RS_Stopped              0x00000000U                             /*!< Stopped - Reset or Stop receive command issued */
#define EMAC_DMASTS_RS_Fetching_Pos         (17U)
#define EMAC_DMASTS_RS_Fetching_Msk         (0x1U << EMAC_DMASTS_RS_Fetching_Pos)   /*!< 0x00020000 */
#define EMAC_DMASTS_RS_Fetching             EMAC_DMASTS_RS_Fetching_Msk             /*!< Running - Fetching receive descriptor */
#define EMAC_DMASTS_RS_Waiting_Pos          (17U)
#define EMAC_DMASTS_RS_Waiting_Msk          (0x3U << EMAC_DMASTS_RS_Waiting_Pos)    /*!< 0x00060000 */
#define EMAC_DMASTS_RS_Waiting              EMAC_DMASTS_RS_Waiting_Msk              /*!< Running - Waiting for receive packet */
#define EMAC_DMASTS_RS_Suspended_Pos        (19U)
#define EMAC_DMASTS_RS_Suspended_Msk        (0x1U << EMAC_DMASTS_RS_Suspended_Pos)  /*!< 0x00080000 */
#define EMAC_DMASTS_RS_Suspended            EMAC_DMASTS_RS_Suspended_Msk            /*!< Suspended - Receive descriptor unavailable */
#define EMAC_DMASTS_RS_Closing_Pos          (17U)
#define EMAC_DMASTS_RS_Closing_Msk          (0x5U << EMAC_DMASTS_RS_Closing_Pos)    /*!< 0x000A0000 */
#define EMAC_DMASTS_RS_Closing              EMAC_DMASTS_RS_Closing_Msk              /*!< Running - Closing receive descriptor */
#define EMAC_DMASTS_RS_TimeWrite_Pos        (18U)
#define EMAC_DMASTS_RS_TimeWrite_Msk        (0x3U << EMAC_DMASTS_RS_TimeWrite_Pos)  /*!< 0x000C0000 */
#define EMAC_DMASTS_RS_TimeWrite            EMAC_DMASTS_RS_TimeWrite_Msk            /*!< Time stamp write status */
#define EMAC_DMASTS_RS_Transfer_Pos         (17U)
#define EMAC_DMASTS_RS_Transfer_Msk         (0x7U << EMAC_DMASTS_RS_Transfer_Pos)   /*!< 0x000E0000 */
#define EMAC_DMASTS_RS_Transfer             EMAC_DMASTS_RS_Transfer_Msk             /*!< Running - Transfer the receive buffer data to host memory */

#define EMAC_DMASTS_NIS_Pos                 (16U)
#define EMAC_DMASTS_NIS_Msk                 (0x1U << EMAC_DMASTS_NIS_Pos)           /*!< 0x00010000 */
#define EMAC_DMASTS_NIS                     EMAC_DMASTS_NIS_Msk                     /*!< Normal Interrupt Summary */
#define EMAC_DMASTS_AIS_Pos                 (15U)
#define EMAC_DMASTS_AIS_Msk                 (0x1U << EMAC_DMASTS_AIS_Pos)           /*!< 0x00008000 */
#define EMAC_DMASTS_AIS                     EMAC_DMASTS_AIS_Msk                     /*!< Abnormal Interrupt Summary */
#define EMAC_DMASTS_ERI_Pos                 (14U)
#define EMAC_DMASTS_ERI_Msk                 (0x1U << EMAC_DMASTS_ERI_Pos)           /*!< 0x00004000 */
#define EMAC_DMASTS_ERI                     EMAC_DMASTS_ERI_Msk                     /*!< Early Receive Interrupt */
#define EMAC_DMASTS_FBEI_Pos                (13U)
#define EMAC_DMASTS_FBEI_Msk                (0x1U << EMAC_DMASTS_FBEI_Pos)          /*!< 0x00002000 */
#define EMAC_DMASTS_FBEI                    EMAC_DMASTS_FBEI_Msk                    /*!< Fatal Bus Error Interrupt */
#define EMAC_DMASTS_ETI_Pos                 (10U)
#define EMAC_DMASTS_ETI_Msk                 (0x1U << EMAC_DMASTS_ETI_Pos)           /*!< 0x00000400 */
#define EMAC_DMASTS_ETI                     EMAC_DMASTS_ETI_Msk                     /*!< Early Transmit Interrupt */
#define EMAC_DMASTS_RWT_Pos                 (9U)
#define EMAC_DMASTS_RWT_Msk                 (0x1U << EMAC_DMASTS_RWT_Pos)           /*!< 0x00000200 */
#define EMAC_DMASTS_RWT                     EMAC_DMASTS_RWT_Msk                     /*!< Receive Watchdog Timeout */
#define EMAC_DMASTS_RPS_Pos                 (8U)
#define EMAC_DMASTS_RPS_Msk                 (0x1U << EMAC_DMASTS_RPS_Pos)           /*!< 0x00000100 */
#define EMAC_DMASTS_RPS                     EMAC_DMASTS_RPS_Msk                     /*!< Receive Process Stopped */
#define EMAC_DMASTS_RBU_Pos                 (7U)
#define EMAC_DMASTS_RBU_Msk                 (0x1U << EMAC_DMASTS_RBU_Pos)           /*!< 0x00000080 */
#define EMAC_DMASTS_RBU                     EMAC_DMASTS_RBU_Msk                     /*!< Receive Buffer Unavailable */
#define EMAC_DMASTS_RI_Pos                  (6U)
#define EMAC_DMASTS_RI_Msk                  (0x1U << EMAC_DMASTS_RI_Pos)            /*!< 0x00000040 */
#define EMAC_DMASTS_RI                      EMAC_DMASTS_RI_Msk                      /*!< Receive Interrupt */
#define EMAC_DMASTS_UNF_Pos                 (5U)
#define EMAC_DMASTS_UNF_Msk                 (0x1U << EMAC_DMASTS_UNF_Pos)           /*!< 0x00000020 */
#define EMAC_DMASTS_UNF                     EMAC_DMASTS_UNF_Msk                     /*!< Transmit Underflow */
#define EMAC_DMASTS_OVF_Pos                 (4U)
#define EMAC_DMASTS_OVF_Msk                 (0x1U << EMAC_DMASTS_OVF_Pos)           /*!< 0x00000010 */
#define EMAC_DMASTS_OVF                     EMAC_DMASTS_OVF_Msk                     /*!< Receive Overflow */
#define EMAC_DMASTS_TJT_Pos                 (3U)
#define EMAC_DMASTS_TJT_Msk                 (0x1U << EMAC_DMASTS_TJT_Pos)           /*!< 0x00000008 */
#define EMAC_DMASTS_TJT                     EMAC_DMASTS_TJT_Msk                     /*!< Transmit Jabber Timeout */
#define EMAC_DMASTS_TBU_Pos                 (2U)
#define EMAC_DMASTS_TBU_Msk                 (0x1U << EMAC_DMASTS_TBU_Pos)           /*!< 0x00000004 */
#define EMAC_DMASTS_TBU                     EMAC_DMASTS_TBU_Msk                     /*!< Transmit Buffer Unavailable */
#define EMAC_DMASTS_TPS_Pos                 (1U)
#define EMAC_DMASTS_TPS_Msk                 (0x1U << EMAC_DMASTS_TPS_Pos)           /*!< 0x00000002 */
#define EMAC_DMASTS_TPS                     EMAC_DMASTS_TPS_Msk                     /*!< Transmit Process Stopped */
#define EMAC_DMASTS_TI_Pos                  (0U)
#define EMAC_DMASTS_TI_Msk                  (0x1U << EMAC_DMASTS_TI_Pos)            /*!< 0x00000001 */
#define EMAC_DMASTS_TI                      EMAC_DMASTS_TI_Msk                      /*!< Transmit Interrupt */

/*****************  Bit definition for EMAC_DMAOPM register  ******************/
#define EMAC_DMAOPM_DT_Pos                  (26U)
#define EMAC_DMAOPM_DT_Msk                  (0x1U << EMAC_DMAOPM_DT_Pos)            /*!< 0x04000000 */
#define EMAC_DMAOPM_DT                      EMAC_DMAOPM_DT_Msk                      /*!< Disable Dropping of TCP/IP Checksum Error Frames */
#define EMAC_DMAOPM_RSF_Pos                 (25U)
#define EMAC_DMAOPM_RSF_Msk                 (0x1U << EMAC_DMAOPM_RSF_Pos)           /*!< 0x02000000 */
#define EMAC_DMAOPM_RSF                     EMAC_DMAOPM_RSF_Msk                     /*!< Receive Store and Forward */
#define EMAC_DMAOPM_DFRF_Pos                (24U)
#define EMAC_DMAOPM_DFRF_Msk                (0x1U << EMAC_DMAOPM_DFRF_Pos)          /*!< 0x01000000 */
#define EMAC_DMAOPM_DFRF                    EMAC_DMAOPM_DFRF_Msk                    /*!< Disable Flushing of Received Frames */
#define EMAC_DMAOPM_TSF_Pos                 (21U)
#define EMAC_DMAOPM_TSF_Msk                 (0x1U << EMAC_DMAOPM_TSF_Pos)           /*!< 0x00200000 */
#define EMAC_DMAOPM_TSF                     EMAC_DMAOPM_TSF_Msk                     /*!< Transmit Store and Forward */
#define EMAC_DMAOPM_FTF_Pos                 (20U)
#define EMAC_DMAOPM_FTF_Msk                 (0x1U << EMAC_DMAOPM_FTF_Pos)           /*!< 0x00100000 */
#define EMAC_DMAOPM_FTF                     EMAC_DMAOPM_FTF_Msk                     /*!< Flush Transmit FIFO */

/*!< TTC configuration */
#define EMAC_DMAOPM_TTC_Pos                 (14U)
#define EMAC_DMAOPM_TTC_Msk                 (0x7U << EMAC_DMAOPM_TTC_Pos)           /*!< 0x0001C000 */
#define EMAC_DMAOPM_TTC                     EMAC_DMAOPM_TTC_Msk                     /*!< Transmit Threshold Control */

