HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f407xc.h
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                       ((INSTANCE) == ADC2) || \
                                       ((INSTANCE) == ADC3))
                                       
#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC12_COMMON)

#define IS_ADC_DMA_CAPABILITY_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                                  ((INSTANCE) == ADC3))

/******************************* CAN Instances ********************************/    
#define IS_CAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == CAN1) || \
                                       ((INSTANCE) == CAN2))

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DAC1) || \
                                       ((INSTANCE) == DAC2))

/******************************* DMA Instances ********************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Channel1) || \
                                       ((INSTANCE) == DMA1_Channel2) || \
                                       ((INSTANCE) == DMA1_Channel3) || \
                                       ((INSTANCE) == DMA1_Channel4) || \
                                       ((INSTANCE) == DMA1_Channel5) || \
                                       ((INSTANCE) == DMA1_Channel6) || \
                                       ((INSTANCE) == DMA1_Channel7) || \
                                       ((INSTANCE) == DMA2_Channel1) || \
                                       ((INSTANCE) == DMA2_Channel2) || \
                                       ((INSTANCE) == DMA2_Channel3) || \
                                       ((INSTANCE) == DMA2_Channel4) || \
                                       ((INSTANCE) == DMA2_Channel5) || \
                                       ((INSTANCE) == DMA2_Channel6) || \
                                       ((INSTANCE) == DMA2_Channel7))
  
/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                        ((INSTANCE) == GPIOB) || \
                                        ((INSTANCE) == GPIOC) || \
                                        ((INSTANCE) == GPIOD) || \
                                        ((INSTANCE) == GPIOE))

/********************* IOMUX Multiplex Function Instances *********************/
#define IS_IOMUX_ALL_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/**************************** GPIO Lock Instances *****************************/
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************* I2C Instances ********************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                       ((INSTANCE) == I2C2) || \
                                       ((INSTANCE) == I2C3))

/****************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE         IS_I2C_ALL_INSTANCE

/******************************* I2S Instances ********************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI2) || \
                                       ((INSTANCE) == SPI3))

/******************************* WDT Instances ********************************/
#define IS_WDT_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WDT)

/******************************* SDIO Instances *******************************/
#define IS_SDIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SDIO1) || \
                                        ((INSTANCE) == SDIO2))

/******************************* SPI Instances ********************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                       ((INSTANCE) == SPI2) || \
                                       ((INSTANCE) == SPI3) || \
                                       ((INSTANCE) == SPI4))

/**************************** START TMR Instances *****************************/
/******************************* TMR Instances ********************************/
#define IS_TMR_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR6)    || \
   ((INSTANCE) == TMR7)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR10)   || \
   ((INSTANCE) == TMR11)   || \
   ((INSTANCE) == TMR12)   || \
   ((INSTANCE) == TMR13)   || \
   ((INSTANCE) == TMR14))

#define IS_TMR_ADVANCED_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_C1_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR10)   || \
   ((INSTANCE) == TMR11)   || \
   ((INSTANCE) == TMR12)   || \
   ((INSTANCE) == TMR13)   || \
   ((INSTANCE) == TMR14))

#define IS_TMR_C2_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8)    || \
   ((INSTANCE) == TMR9)    || \
   ((INSTANCE) == TMR12))

#define IS_TMR_C3_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

#define IS_TMR_C4_INSTANCE(INSTANCE)\
  (((INSTANCE) == TMR1)    || \
   ((INSTANCE) == TMR2)    || \
   ((INSTANCE) == TMR3)    || \
   ((INSTANCE) == TMR4)    || \
   ((INSTANCE) == TMR5)    || \
   ((INSTANCE) == TMR8))

